if
new
=
int
String
return
for
void
java.lang.String
else
append
java.lang.StringBuffer
boolean
java.util.List
iterator
final
while
[
java.util.Iterator
try
size
hasNext
]
equals
Iterator
java.util.Map
add
static
toArray
get
length
instanceof
java.util.ArrayList
org.eclipse.swt.widgets.Button
setText
java.io.File
org.eclipse.swt.widgets.Composite
java.util.Set
put
next
substring
ArrayList
GridData
StringBuffer
case
org.eclipse.swt.internal.Lock
toString
getSelection
this
throws
getName
catch
File
char
getOffset
finally
org.eclipse.swt.widgets.Control
org.eclipse.swt.widgets.Text
do
Object
setEnabled
setSelection
break
throw
isDisposed
indexOf
isEmpty
dispose
setLayoutData
setFont
getText
org.eclipse.swt.widgets.Shell
org.eclipse.swt.graphics.GC
synchronized
java.util.Vector
java.util.Collection
org.eclipse.swt.widgets.Label
error
org.eclipse.swt.widgets.Table
getShell
org.eclipse.jface.viewers.IStructuredSelection
bind
remove
exists
keySet
startsWith
contains
byte
java.util.HashMap
java.lang.Class
run
org.eclipse.jface.text.IDocument
checkWidget
getLength
continue
org.eclipse.jface.viewers.TreeViewer
org.eclipse.swt.widgets.Combo
org.eclipse.swt.widgets.Display
getDefault
org.eclipse.jface.viewers.TableViewer
getString
getControl
java.io.PrintStream
Button
trim
java.lang.Object
values
Sy
getProperty
Label
getId
java.io.PrintWriter
setLayout
Integer
entrySet
Composite
charAt
println
org.eclipse.jface.dialogs.IDialogSettings
GridLayout
write
HashSet
org.eclipse.jface.text.IRegion
StringTokenizer
widgetSelected
getAttribute
setBackground
valueOf
getValue
org.eclipse.jface.preference.IPreferenceStore
org.eclipse.swt.custom.StyledText
java.net.URL
format
log
Point
java.util.StringTokenizer
java.util.Hashtable
addAll
List
HashMap
java.util.Properties
Rectangle
Path
getKey
max
org.eclipse.swt.widgets.Tree
org.eclipse.swt.graphics.Image
getParent
org.eclipse.swt.widgets.TreeItem
java.util.HashSet
hashCode
long
setValue
endsWith
getDisplay
Status
java.lang.Boolean
hasMoreTokens
java.util.Map.Entry
IStructuredSelection
getFont
nextToken
java.lang.Integer
org.eclipse.swt.widgets.TableItem
print
setImage
hasMoreElements
asList
open
min
getType
getTable
getClass
containsKey
getData
java.io.DataInputStream
equalsIgnoreCase
getMessage
java.io.InputStream
org.eclipse.jface.viewers.CheckboxTableViewer
getPreferenceStore
clear
switch
java.util.Enumeration
setForeground
IResource
replace
accept
isEnabled
create
lastIndexOf
close
org.eclipse.jface.action.IMenuManager
setAttribute
getBoolean
getDocument
Control
getDialogSettings
org.eclipse.swt.graphics.Color
setVisible
getItem
org.eclipse.swt.widgets.Canvas
getViewer
getResourceString
getBounds
Image
isTrue
getLocation
selectionChanged
getPath
Bo
getAddress
Set
getStyle
org.eclipse.jface.action.IAction
IllegalArgumentException
getImage
getItemCount
update
Text
setToolTipText
parseInt
nextElement
intValue
org.eclipse.swt.browser.Browser
setInput
org.eclipse.jface.util.PropertyChangeEvent
org.eclipse.jface.viewers.CheckboxTreeViewer
setData
org.eclipse.swt.widgets.MenuItem
org.eclipse.swt.widgets.Menu
showWhile
getSystemColor
getWorkbench
getChildren
getTree
org.eclipse.swt.widgets.ToolItem
refresh
setProperty
Separator
beginTask
Region
isDirectory
org.eclipse.jface.text.Position
org.eclipse.swt.widgets.Item
org.eclipse.swt.widgets.ScrollBar
setFocus
getFile
setChecked
java.net.URI
StructuredSelection
DEBUG
keys
getElementName
getInstance
extends
org.eclipse.jface.action.MenuManager
setMessage
getVersion
getAbsolutePath
Shell
org.eclipse.swt.widgets.Group
toLowerCase
elementAt
getSeverityString
org.eclipse.jface.viewers.StructuredViewer
isMainThread
getLineOfOffset
org.eclipse.jface.text.ITextViewer
getTextWidget
org.eclipse.swt.widgets.Widget
alloc
org.eclipse.jface.action.Action
Ja
Enumeration
isNotNull
org.eclipse.swt.internal.Callback
TableItem
getItems
java.io.DataOutputStream
propertyChange
createComposite
java.lang.Throwable
getSite
init
getProject
getAdapter
writeInt
visit
read
addSelectionListener
org.eclipse.jface.text.ITextSelection
org.eclipse.jface.text.source.SourceViewer
getSelectionIndex
org.eclipse.swt.widgets.TableColumn
arraycopy
createControl
getSize
setContentProvider
java.io.OutputStream
getBackground
Vector
computeSize
getParentFile
getFirstElement
getElements
IOException
set
java.util.Stack
getLabel
setErrorMessage
Color
setDefault
java.lang.Thread
ByteArrayInputStream
memmove
convertWidthInCharsToPixels
getProtocol
toFile
MenuItem
setLabelProvider
java.io.IOException
booleanValue
default
getSymbolicName
getEnabled
getLineInformation
Entry
java.util.ResourceBundle
getClientArea
handleEvent
org.eclipse.jface.viewers.ISelectionProvider
openError
setRedraw
org.eclipse.swt.graphics.Font
FormAttachment
delete
getFullPath
getBundle
Position
isVisible
org.eclipse.swt.widgets.ToolBar
listIterator
CoreException
Font
createDialogArea
FileOutputStream
removeAll
org.eclipse.swt.widgets.List
ToolItem
isEditable
release
org.eclipse.jface.wizard.WizardDialog
Display
getImageDescriptor
getSource
select
Properties
getRoot
IPath
NSString
getContext
getElement
ISelection
setLength
java.lang.reflect.InvocationTargetException
TreeItem
setSize
java.util.LinkedList
convertHorizontalDLUsToPixels
setName
org.eclipse.jface.resource.ImageDescriptor
elements
Table
org.eclipse.jface.viewers.ISelection
createLabel
addElement
org.eclipse.swt.graphics.TextLayout
java.lang.Exception
load
org.eclipse.swt.widgets.FileDialog
Map
getForeground
NSAutoreleasePool
isWhitespace
org.eclipse.swt.widgets.Spinner
getColumn
org.eclipse.swt.custom.CTabFolder
getInput
IInstallableUnit
setItems
compareTo
Menu
targetRequestFailed
flush
WizardDialog
addListener
getWorkspace
SubProgressMonitor
java.math.BigInteger
getLineInformationOfOffset
org.eclipse.swt.ole.win32.Variant
Group
IRegion
org.eclipse.jface.text.source.ISourceViewer
FileInputStream
printStackTrace
pack
org.eclipse.jface.viewers.TreePath
isFile
getPlugin
setBounds
initialize
currentTimeMillis
MoveMemory
find
Co
java.util.Dictionary
createButton
java.util.ListIterator
getInt
org.eclipse.jface.action.IToolBarManager
getStatus
System.out.println
MenuManager
okPressed
getHost
getURL
getSection
getCurrent
org.eclipse.jface.wizard.IWizardContainer
setLocation
IJavaElement
createContextMenu
FileDialog
ASTNode
getCompilationUnit
currentThread
getProperties
readInt
compare
redraw
getLineOffset
getModel
getChecked
toCharArray
IDocument
TableColumn
readAndDispatch
org.eclipse.jface.text.DocumentEvent
org.eclipse.jface.dialogs.TrayDialog
Collection
IType
Hashtable
java.io.BufferedReader
java.lang.StringBuilder
org.eclipse.swt.widgets.TreeColumn
org.eclipse.swt.internal.mozilla.XPCOMObject
convertHeightInCharsToPixels
org.eclipse.swt.widgets.TabItem
releaseWidget
IFile
execute
getService
java.io.Writer
createPushButton
start
java.util.zip.ZipFile
getterCalled
getContainer
BufferedInputStream
toOSString
getPage
StyledText
IProject
debug
org.eclipse.jface.viewers.Viewer
org.eclipse.swt.graphics.Rectangle
org.eclipse.swt.internal.cocoa.NSString
org.eclipse.swt.internal.cocoa.NSAutoreleasePool
org.eclipse.jface.action.ToolBarManager
setTitle
Long
double
org.eclipse.swt.internal.ole.win32.COMObject
getSelectionProvider
setEditable
getModifiers
save
getNewValue
org.eclipse.jface.viewers.SelectionChangedEvent
org.eclipse.swt.custom.StyledTextContent
setHelp
toExternalForm
getResource
getDescription
PrintWriter
setWidth
Combo
toUpperCase
org.eclipse.swt.custom.CLabel
org.eclipse.jface.preference.PreferencePage
setCheckedElements
Boolean
ServiceTracker
getJavaProject
Gr
getScheme
putString
Locale
IPluginModelBase
getHelpSystem
Expression
getSourceViewer
getKind
configureShell
fragments
Class
VtblCall
countTokens
layout
java.io.ByteArrayOutputStream
sort
IDialogSettings
_VtblCall
org.eclipse.jface.action.IContributionItem
readLine
java.io.BufferedWriter
setComparator
mkdirs
createContents
writeUTF
getInteger
fillContextMenu
org.eclipse.swt.internal.cocoa.NSObject
org.eclipse.swt.widgets.Link
getTypeName
segmentCount
getFontMetrics
getActiveWorkbenchShell
StyleRange
RuntimeException
updateSeverity
toList
getPluginBase
clone
getLayoutData
short
IWorkingSet
org.eclipse.swt.widgets.Scrollable
matches
getColor
createChild
ID
Callback
getBytes
Annotation
getAnnotationIterator
java.util.regex.Matcher
BufferedReader
okToUse
setDescription
Spinner
insert
setButtonEnabled
getDefaultBoolean
getIdentifier
getBody
parse
readUTF
PR
Pr
ZipEntry
AccessibleControlListener
worked
MessageBox
IContributionItem
Date
org.eclipse.swt.custom.StyledTextRenderer
getCategory
getPropertyFormat
Clipboard
performOk
De
java.io.StringWriter
org.eclipse.swt.internal.cocoa.NSTableView
org.eclipse.swt.widgets.Caret
stringWith
org.eclipse.swt.internal.cocoa.NSWindow
java.util.zip.ZipEntry
entries
setFilterPath
org.eclipse.swt.widgets.TabFolder
setMenu
org.eclipse.jface.viewers.CheckStateChangedEvent
toDisplay
Lo
getAST
getAction
ICompilationUnit
isAbsolute
org.eclipse.swt.widgets.Decorations
org.eclipse.jface.dialogs.Dialog
IStatus
RGB
setImageDescriptor
org.eclipse.jface.viewers.ViewerCell
perform
org.eclipse.swt.custom.ScrolledComposite
org.eclipse.jface.text.ITypedRegion
getInputStream
sendEvent
doubleClick
org.eclipse.swt.internal.win32.TCHAR
getRGB
org.eclipse.swt.internal.cocoa.NSView
getVisible
setType
ImageData
FontData
dumpPcNumber
In
AccessibleTextExtendedListener
BundleDescription
performDefaults
setControl
SuppressWarnings
getEntry
statements
registerService
createImage
NSRect
IllegalStateException
TypedRegion
org.eclipse.swt.dnd.Clipboard
DirectoryDialog
BuildException
getContents
getContentProvider
org.eclipse.swt.examples.accessibility.CTable
IConfigurationElement
org.eclipse.swt.custom.CCombo
printExpression
JF
org.eclipse.ui.forms.widgets.Section
removeListener
getLabelProvider
fillRectangle
java.io.FileOutputStream
releaseHandle
getPosition
checkStateChanged
org.eclipse.jface.text.templates.Template
Di
Pl
isOK
getColumnCount
getServiceReference
widgetDisposed
URL
getInstallLocation
org.eclipse.jface.viewers.ILabelProvider
isCanceled
getTreeViewer
org.eclipse.jface.layout.GridDataFactory
setHeaderVisible
org.eclipse.jface.resource.ImageRegistry
Document
isFocusControl
Th
validate
setPageComplete
org.eclipse.swt.custom.SashForm
addFilter
org.eclipse.jface.text.Document
org.eclipse.core.runtime.CoreException
getDialogFont
PixelConverter
StringWriter
org.eclipse.swt.graphics.FontMetrics
newSimpleName
concat
java.lang.reflect.Method
CPListElement
org.eclipse.swt.custom.CTabItem
drawLine
setClipping
org.eclipse.jface.text.source.IAnnotationModel
appendPaddedInt
register
org.eclipse.swt.widgets.CoolItem
org.eclipse.swt.accessibility.Accessible
org.eclipse.jface.viewers.ITreeContentProvider
org.eclipse.swt.internal.cocoa.NSBezierPath
org.eclipse.jface.bindings.Binding
org.eclipse.jface.text.contentassist.ContentAssistant
getHeight
getEditorInput
updateButtons
java.lang.Runnable
java.lang.Long
IJavaProject
getButton
org.eclipse.swt.widgets.DirectoryDialog
isDigit
java.lang.RuntimeException
ListIterator
org.eclipse.swt.graphics.ImageData
setSource
replaceAll
Cursor
org.eclipse.jface.text.TypedPosition
FrameworkLogEntry
readBoolean
InputStreamReader
getStartLine
ParameterInfo
TextEdit
getOS
org.eclipse.swt.custom.TableCursor
paint
org.eclipse.jface.viewers.AbstractTreeViewer
reset
isOkToUse
org.eclipse.swt.graphics.Region
Tree
configure
AccessibleTableListener
LinkedHashSet
isChecked
java.lang.ThreadLocal
setSelectedRange
count
java.util.TreeMap
nsEmbedString
getDeclaringType
convertVerticalDLUsToPixels
parameters
getState
getFeature
BundleInfo
setError
org.eclipse.jface.wizard.IWizard
org.eclipse.jface.dialogs.MessageDialog
isStatic
getElementType
MultiStatus
ICompletionProposal
org.eclipse.swt.internal.cocoa.NSEvent
getVerticalBar
getNumberOfLines
Type
checkDevice
bodyDeclarations
setFilterExtensions
VariableDeclarationFragment
query
ITypeBinding
getElementAt
getMethod
getOffsetAtLine
subMonitorFor
appendToGroup
getNodeName
wcsToMbcs
org.eclipse.jface.layout.PixelConverter
setElements
map
typeArguments
java.lang.reflect.Field
overlapsWith
org.eclipse.swt.graphics.FontData
setMaximum
setId
getDevice
makeRelative
regionMatches
getFontData
getTableViewer
toURI
org.eclipse.jface.wizard.IWizardPage
addSelectionChangedListener
ToolBar
org.eclipse.jface.wizard.Wizard
org.eclipse.swt.ole.win32.OleAutomation
releaseParent
DataInputStream
getQualifiedName
getBundleDescription
isValid
getStartPosition
toURL
org.eclipse.swt.internal.cocoa.NSArray
convert
StatusInfo
IP
createColor
TableWrapData
lastSegment
IMember
org.eclipse.jface.viewers.StyledString
org.eclipse.swt.widgets.MessageBox
split
createMsg
getPluginId
getFileExtension
java.util.SortedSet
getException
getLineDelimiter
Version
LinkedList
removeLastSegments
scan
org.eclipse.swt.widgets.ImageList
getFlags
drawImage
modifyText
AccessibleTableEvent
getUniqueIdentifier
CO
getResources
TreeColumn
setCursor
logError
TableViewer
getTarget
getChangeType
matcher
openTD
modifiers
org.eclipse.jface.dialogs.StatusDialog
invoke
setStyle
getChars
printIndent
ReplaceEdit
resolve
getBundleId
getTargetException
fill
setOffset
org.eclipse.swt.widgets.EventTable
PaletteData
IClasspathEntry
createText
java.util.Locale
drawString
getChildNode
TabItem
subTask
org.eclipse.jface.dialogs.TitleAreaDialog
org.eclipse.swt.widgets.CoolBar
org.eclipse.jface.bindings.BindingManager
arguments
isSelected
Release
merge
org.eclipse.swt.examples.graphics.GraphicsBackground
getToolBarManager
reskin
isDeleted
org.eclipse.swt.internal.cocoa.NSGraphicsContext
getListeners
ColumnWeightData
createFatalErrorStatus
textExtent
_getChildren
match
getItemHeight
segment
includes
ITextSelection
org.eclipse.ui.dialogs.SelectionDialog
NullPointerException
initWithString
stringExtent
translate
checkSubclass
getPattern
g_signal_connect
org.eclipse.jface.text.templates.persistence.TemplatePersistenceData
getTemplate
apiLevel
getFileName
org.eclipse.jface.action.IStatusLineManager
lastModified
getVisibleRegion
addImport
deregister
getHeaderHeight
TemplatePersistenceData
org.eclipse.swt.internal.image.LEDataInputStream
listFiles
org.eclipse.swt.internal.cocoa.NSOutlineView
isPublic
java.util.Calendar
fillDefaults
JarEntry
store
applyDialogFont
createElement
getAttributes
initializeDialogUnits
IMarker
getOption
RemoveEventListener
getLineNumber
updateSelection
NSAttributedString
getBgColor1
getPort
toHexString
getToolTipText
applyTo
getWS
NullProgressMonitor
getSelectedResources
BufferedOutputStream
saveState
apply
St
org.eclipse.swt.graphics.Cursor
yearOfCommonEra
getIDsOfNames
OutputStreamWriter
getBundleContext
java.lang.SecurityManager
Template
Variant
newInstance
push
org.eclipse.swt.graphics.Path
handleRemove
getExpression
getEditor
org.eclipse.jface.viewers.ListViewer
getListRewrite
getImageData
NSSize
getPartition
IsEqualGUID
install
AddEventListener
getWidth
setTaskName
writeLong
java.io.Reader
org.eclipse.debug.core.DebugEvent
org.eclipse.swt.examples.graphics.GraphicsExample
setColor
getSegmentCount
setParent
SendMessage
Bundle
name
setContents
URI
TreePath
isInterface
getHorizontalBar
copy
ServiceReference
org.eclipse.swt.internal.cocoa.NSMutableArray
addColumnData
decode
IMethod
java.util.jar.JarFile
addNewSection
setContent
org.eclipse.swt.internal.cocoa.NSTableColumn
getTablePart
dateWithYear
setResizable
org.eclipse.swt.accessibility.AccessibleControlListener
createWidget
getLocale
IAction
org.eclipse.swt.internal.cocoa.NSTextView
checkData
elementToHandle
org.eclipse.jface.dialogs.MessageDialogWithToggle
java.util.regex.Pattern
org.eclipse.swt.examples.accessibility.CTableColumn
addToHistory
setExampleWidgetState
StringBuilder
FillLayout
checkLayout
getChar
setVersion
getTime
getSelectedElements
org.eclipse.jface.wizard.WizardPage
disconnect
java.net.URLConnection
hookEvents
java.lang.CharSequence
getParameterTypes
getDefaultStyle
writeByte
NameVersionDescriptor
newCoreException
getReturnType
org.eclipse.jface.preference.PreferenceDialog
getHref
getIndex
org.eclipse.swt.widgets.DateTime
getToolkit
java.lang.ClassLoader
connect
IW
org.eclipse.jface.text.rules.ICharacterScanner
getEntryKind
org.eclipse.swt.accessibility.AccessibleTextExtendedListener
notifyListeners
org.eclipse.jdt.core.IJavaElement
TreeSet
getCanonicalFile
performApply
org.eclipse.swt.widgets.Monitor
appendChild
trace
IAdaptable
setFileName
NSArray
isDirty
At
asString
java.util.Date
createError
RE
handle
org.eclipse.jface.resource.FontRegistry
done
org.eclipse.swt.graphics.Transform
org.eclipse.jface.viewers.CellEditor
BigInteger
setDocument
Throwable
getLocalizedMessage
hasChildren
CVSTag
isLegal
MessageDialog
makeAbsolute
draw
getViewSite
java.io.RandomAccessFile
getWarnings
BufferedWriter
org.eclipse.jface.fieldassist.ControlDecoration
getCanonicalPath
OperationCanceledException
getKeys
getDescriptor
ILaunchConfiguration
BodyDeclaration
getTextControl
NSPoint
getFullyQualifiedName
types
computeTrim
getLog
getAnnotation
getSeverity
IBreakpoint
setGrayed
Change
getLineAtOffset
SingleVariableDeclaration
org.eclipse.swt.internal.cocoa.NSMenuItem
printAttribute
hooks
org.eclipse.jdt.core.IType
getActiveShell
getQualifier
org.eclipse.jface.layout.GridLayoutFactory
Link
updateStatus
org.eclipse.jface.preference.IntegerFieldEditor
getShells
createGridData
org.eclipse.jdt.core.ICompilationUnit
objectAtIndex
Si
org.eclipse.jface.viewers.ViewerRow
getCurrentPage
getLineCount
org.eclipse.jface.viewers.ViewerLabel
createCheckButton
setRemoveAllWhenShown
findItem
getSimpleName
ControlData
NSIndexSet
setDisabledImageDescriptor
getCause
org.eclipse.swt.internal.cocoa.NSCell
Ta
addPosition
ZipFile
getLine
readByte
transferStreams
item
createRadioButton
isSupportedType
TreeViewer
org.eclipse.jface.viewers.LabelProvider
getWorkingDirectory
typeParameters
org.eclipse.swt.dnd.Transfer
getPreferences
removePropertyChangeListener
getDebugOption
getActionBars
org.eclipse.jdt.internal.debug.ui.JDISourceViewer
org.eclipse.swt.internal.cocoa.NSTextField
setLinesVisible
monthOfYear
saveSettings
org.eclipse.swt.internal.mozilla.nsEmbedString
getBuffer
isUpperCase
AntCompletionProposal
warn
getLaunchManager
createPartControl
getFilter
getFactory
org.eclipse.swt.examples.accessibility.CTableItem
isReadOnly
getParentItem
displayError
checkRealm
setExpandedState
org.eclipse.swt.internal.cocoa.NSAttributedString
verbose
InputStream
getLineIndex
java.lang.Process
org.eclipse.swt.examples.controlexample.Tab
addPages
org.eclipse.swt.internal.cocoa.NSIndexSet
ASTRewriteCorrectionProposal
objc_msgSend
abs
getTextLayout
Binding
java.io.FileInputStream
Method
setURL
AccessibleControlEvent
getWritableString
getID
getPreferenceKey
org.eclipse.swt.internal.image.LEDataOutputStream
org.eclipse.swt.accessibility.AccessibleTableListener
org.eclipse.swt.widgets.Sash
org.eclipse.jface.dialogs.InputDialog
org.eclipse.swt.internal.cocoa.NSCalendarDate
reskinChildren
convertPoint_fromView_
java.util.jar.JarEntry
canFinish
getContextId
getSignature
restoreProperty
IRuntimeClasspathEntry
addChild
putValue
printTab
getWorkbenchWindow
openQuestion
getLayout
getCalendarDate
Field
getX
getContextType
NSNumber
getManager
IC
getExpanded
setEditor
selectAll
forName
sleep
Pattern
getLineHeight
setDefaultButton
setExpression
getProfileId
logException
getAdditions
Config
OverlayKey
org.eclipse.jface.text.source.ILineRange
Match
setTime
createHandle
handleSelectionChanged
TType
openStream
ByteArrayOutputStream
FileInfo
getNode
addModifyListener
deleteCharAt
setPreferenceStore
putInteger
org.eclipse.swt.internal.cocoa.NSApplication
blend
ResourceMapping
logErrorMessage
isConstructor
covers
setTransform
findModel
readLong
StyledString
java.util.TreeSet
TagElement
selectAndReveal
IPackageFragment
setToDefault
setSortColumn
ceil
NSCell
Category
ProvisionException
getNodeType
setResult
getVersionedIdentifier
getPositions
FontMetrics
getTopIndex
getParameter
commit
displayMessageDialog
org.eclipse.jface.viewers.StructuredSelection
getBundles
acquireService
LinkedPosition
exec
NSEvent
setBackgroundPattern
getOptions
org.eclipse.jface.viewers.ColumnViewer
Exception
getPluginPreferences
Widget
org.eclipse.jface.resource.ResourceManager
getNextPage
getLineLength
newErrorStatus
setMinimumPageSize
createStyleGroup
NSRange
FileWriter
getJavaElementName
ToolBarManager
stop
org.eclipse.swt.custom.ViewForm
IVMInstall
getOldValue
resolveBinding
org.eclipse.jface.text.contentassist.ContentAssistSubjectControlAdapter
getConfigurationElements
setThumb
getCharCount
runInUIThread
getMenu
encode
getDocumentProvider
setAlignment
getExtension
getConfigInfos
java.lang.Number
getPackage
ClassLoader
org.eclipse.jface.viewers.DoubleClickEvent
getDefaultString
TextAttribute
org.eclipse.pde.internal.ui.shared.CachedCheckboxTreeViewer
getTagName
TextLayout
getStart
PD
containsAll
handleException
setMinimum
org.eclipse.swt.internal.theme.Theme
FormData
readString
org.eclipse.jface.text.Region
addMenuListener
Ex
org.eclipse.jface.text.IRewriteTarget
readableName
getPackageFragment
isAccessible
org.eclipse.swt.internal.cocoa.NSImage
getStore
getOutputStream
setExpandedElements
getRed
removeFirstSegments
org.eclipse.ui.forms.widgets.ImageHyperlink
org.eclipse.jface.preference.IPreferenceNode
java.lang.Double
org.eclipse.jface.resource.ColorRegistry
setDescriptionText
getContent
isLetterOrDigit
attribute
putAll
isAbstract
org.eclipse.ui.dialogs.PropertyPage
getSelectedRange
compile
getMarker
tags
IT
setAllChecked
TreeMap
isDefault
hasOneOf
IRequirement
revealRange
SyncInfo
getUrl
getPlatform
isPrimitive
Event
getFocusControl
getDestinationValue
getResult
getFontRegistry
Thread
computeRuns
getLinePixel
newCheckList
getCommand
printDebugTab
performFinish
org.eclipse.swt.internal.cocoa.NSLayoutManager
isArray
getContentType
AnnotationPreference
getEntries
checkAdvancedGraphics
TableLayout
getWorkingSetManager
splitOn
getLabelControl
IFeature
getProjectRelativePath
findMember
newStatus
addAction
observe
buttonPressed
getCaretOffset
org.eclipse.jface.viewers.ComboViewer
Stack
hourOfDay
getList
subList
Saveable
org.eclipse.jdt.internal.ui.viewsupport.ProblemTreeViewer
getRuntime
java.net.Socket
isDefined
setMaximizedControl
RefactoringStatus
ResolverBundle
Character
printStatement
org.eclipse.jface.window.IShellProvider
cocoa_new
org.eclipse.swt.internal.cocoa.NSButton
getColumnText
getTitle
longValue
getLockObject
getClassName
retain
org.eclipse.jface.text.templates.TemplateVariable
destroyWidget
MarkerType
subtract
ScrollBar
IFeatureModel
filter
org.eclipse.swt.widgets.Synchronizer
addPropertyChangeListener
org.eclipse.jface.bindings.keys.IKeyLookup
createButtonsForButtonBar
ILabelProvider
getTypes
setPageIncrement
updateCount
toControl
modelRange2WidgetRange
setRGB
org.eclipse.jface.util.LocalSelectionTransfer
Equals
Transform
fromString
EN
Fi
org.eclipse.ui.part.PageBook
newChild
Diff
fillPolygon
NS
org.eclipse.jface.text.TextViewer
writeEntry
getDate
getGrayed
createClearGridLayout
openConnection
getThread
resetCache
getAverageCharWidth
printModifiers
getOs
org.eclipse.swt.custom.TableTreeItem
NSView
org.eclipse.equinox.p2.metadata.Version
org.eclipse.jface.text.ILineTracker
getContextTypeId
getMonitor
org.eclipse.jface.util.IPropertyChangeListener
toFileURL
setModel
getNamespace
expandToLevel
string
java.util.LinkedHashSet
org.eclipse.swt.browser.WebKit
java.util.jar.Manifest
getRemovals
getActiveWorkbenchWindow
Statement
VersionRange
org.eclipse.swt.dnd.DropTarget
getAccessible
canPaste
DE
getArrayFromString
isAvailable
evaluate
getInitialLocation
setTarget
getAnnotationModel
org.eclipse.jface.action.IContributionManager
createExampleWidgets
computeDisplayText
getSelectionCount
main
org.eclipse.jface.text.link.LinkedPosition
java.util.LinkedHashMap
removeLeadingSpaces
ResourceTraversal
propertyNames
putBoolean
getDeclaringClass
ITypeConstraint
org.eclipse.jface.text.templates.persistence.TemplateStore
getUnderlyingResource
org.eclipse.swt.widgets.ExpandItem
showErrorDialog
setSeverity
isPageComplete
CreateErrorString
SimpleName
setButtonLayoutData
adjustTrailingSlash
Pa
GroupMarker
getMetaArea
org.eclipse.jface.dialogs.ProgressMonitorDialog
org.eclipse.swt.internal.cocoa.NSBitmapImageRep
IE
skip
transform
isPrefixOf
setAlpha
getNewName
ImageDescriptor
process
getModes
org.eclipse.swt.internal.cocoa.NSMenu
setChildren
getCheckedElements
getColumns
getPreferencesService
ICVSRemoteResource
getFragments
EclipseFileObject
BundleException
AddRef
expandAll
getRealm
getColorManager
Double
getStyleRanges
getDialogBoundsSettings
getBuildProperties
CLabel
getImageRegistry
computePartitioning
setSubtreeChecked
getMaximum
org.eclipse.swt.internal.cocoa.NSAffineTransform
java.util.SortedMap
FormToolkit
initializeFields
getStatusLineManager
createShell
DataOutputStream
removeSelectionChangedListener
java.util.Comparator
isAssignableFrom
getConfigurationLocation
getColors
org.eclipse.swt.widgets.ExpandBar
dragStart
reveal
setUseHashlookup
setAction
org.eclipse.jface.text.TextAttribute
insertAfter
org.eclipse.swt.widgets.ProgressBar
setDialogSize
org.eclipse.ui.internal.WorkbenchWindow
getReplacementOffset
writeBoolean
writeNewLine
createIUAnyQuery
createPage
NSImage
GCHandle_Free
createTempFile
RefactoringDescriptorProxy
org.eclipse.jface.text.source.SourceViewerConfiguration
superInterfaceTypes
LayoutPart
addAccessibleListener
controlResized
getExtensions
loadBoolean
Variable
requestID
retainAll
getSecurityManager
getSettings
addControlAccessibleListener
Me
addMouseListener
visitList
IJ
parseVersion
getFolder
getProvider
BindingElement
addSetting
hasFocus
CodeTemplateContext
sharedApplication
getJavaElement
setExpanded
normalize
Ab
isPrivate
loadClass
createCopyTarget
dayOfMonth
getMemoryBlock
containsValue
inputChanged
getLocationAtOffset
initializers
org.eclipse.jface.text.source.Annotation
getPDEEditor
getDirective
getPlugins
ISourceContainer
firePropertyChange
isFragment
Attributes
IVariableBinding
cell
setDebug
validateInput
getDefaultLineDelimiter
org.eclipse.jface.bindings.TriggerSequence
printTargetDeclaration
TextSelection
Ap
drawRectangle
VE
getDebugTarget
isResolved
IField
minuteOfHour
org.eclipse.jface.text.projection.Fragment
getMenuManager
java.io.FileWriter
getArtifacts
org.eclipse.jface.preference.FieldEditor
UR
getValues
putNextEntry
getCurrentSelection
pop
fireSelection
isBinary
org.eclipse.jdt.core.IJavaProject
org.eclipse.swt.graphics.Device
updateTitle
matchReportReference
peek
getWorkingSet
getArrayFromList
getTextEditor
openInformation
org.eclipse.swt.examples.paint.PaintSurface
getContributor
addEntry
java.util.zip.ZipInputStream
keyPressed
AccessibleTextEvent
IA
Name
cancelPressed
org.eclipse.swt.dnd.DragSource
isActive
DirtyRegion
org.eclipse.swt.widgets.ColorDialog
uninstall
getHeaderVisible
BrowserFunction
Ut
getArguments
getChangedObjects
getSharedImages
java.lang.IllegalArgumentException
MarkerFieldFilterGroup
addCommand
Reference
getFieldEditorParent
getHandleIdentifier
removePosition
getStructuredSelection
java.io.ObjectOutputStream
getWizard
org.eclipse.jface.action.ActionContributionItem
org.eclipse.jface.text.source.ILineDiffInfo
getServiceReferences
org.eclipse.jface.action.ContributionItem
widgetDefaultSelected
getWidgetProperty
createActions
SearchMatch
CVSStatus
frame
CM
getInitialElementSelections
isClass
findWord
ViewerComparator
swap
org.eclipse.swt.widgets.Slider
getHeaders
CheckboxTreeViewer
org.eclipse.jdt.internal.ui.preferences.PropertyAndPreferencePage
NSScreen
changed
currentValue
getTriggerSequence
writeShort
restoreState
storeSettings
toStringInfo
NSMutableParagraphStyle
setBackgroundColor
org.eclipse.jface.text.templates.TemplateContextType
_getItem
setFontList
createPreferenceDialogOn
getSchemeSpecificPart
getRegion
DI
InterruptedException
getUserInfo
drawText
createViewer
getColumnIndex
Cl
org.eclipse.swt.internal.webkit.IWebView
showPage
org.eclipse.jface.preference.ColorSelector
addDirtyRegion
canWrite
DrawText
getEscaped
available
Monitor
fillPath
addCheckBox
Canvas
SourceViewer
T
getParameterizedCommand
window
org.eclipse.swt.ole.win32.OleFrame
isOptional
org.eclipse.ui.dialogs.ContainerCheckedTreeViewer
updateProjectsList
addTrailingSeparator
isFocusCaret
createExecutableExtension
releaseChildren
IApiType
getHoverInfo
NSMutableAttributedString
getResourceBundle
openErrorDialog
getSystemCursor
IContainer
ActionContributionItem
getJavaModelManager
getMember
java.util.jar.JarOutputStream
getButtonWidthHint
getPart
org.eclipse.swt.widgets.Scale
getConfiguration
getArray
cancel
IAnnotationModel
getForm
TypedPosition
NSTextStorage
mbcsToWcs
org.eclipse.swt.custom.TableTree
Wi
SashForm
getArch
getResourceName
getAdapterManager
newLine
setAntialias
getDimensions
getTaskName
addWidget
setHost
ICVSRepositoryLocation
GraphicsBackground
CTabItem
IPreferenceNode
org.eclipse.ui.navigator.CommonViewer
PL
setSourceRange
An
setOrientation
org.eclipse.jface.dialogs.DialogPage
toPortableString
ProjectionDocumentEvent
LocalOption
setLastModified
org.eclipse.swt.graphics.PaletteData
SelectionChangedEvent
TA
moveUp
isTabGroup
TableRenderingLine
ServiceComponentProp
getCodePage
ColorMenu
StreamConsumer
Browser
createString
updateMonitor
java.io.FileNotFoundException
org.eclipse.jdt.internal.ui.javaeditor.JavaSourceViewer
addError
assert
org.eclipse.swt.browser.WebBrowser
shortReadableName
shutdown
FileSet
org.eclipse.jface.text.link.LinkedModeModel
extendedOperands
getDecimalSeparator
Manifest
getNL
mkdir
FI
hasPrevious
thrownExceptions
IArtifactKey
org.eclipse.jface.resource.LocalResourceManager
getSuperclass
QueryInterface
deselectAll
XtIsRealized
isFinal
handleDelete
showItem
org.eclipse.jface.text.ITextViewerExtension5
newBlock
getThenStatement
isLetter
copySubtree
TypeParameter
createGroup
enableWidget
setWarnings
updateEnablements
getCheckboxTreeViewer
getBgImage
getGreen
isCollapsed
isOpen
org.eclipse.swt.internal.cocoa.NSFont
setWorkingDirectory
org.eclipse.swt.internal.cocoa.NSTextStorage
gtk_widget_get_style
org.eclipse.jface.text.source.projection.ProjectionViewer
charValue
getAncestor
secondOfMinute
getView
abort
setHeader
org.eclipse.jdt.internal.ui.preferences.OptionsConfigurationBlock.Key
NSMenu
java.util.zip.ZipOutputStream
removeFilter
ServiceComponent
NSWindow
getActivePage
LineRange
getRepository
org.eclipse.jface.fieldassist.FieldDecoration
getPresentationContext
isEnabledFor
getTargetPlatformService
CollectionElementVariable2
ensureModelEditable
isJavaIdentifierPart
NSMutableDictionary
topHandle
org.eclipse.jdt.ui.actions.OpenAction
getExpandedElements
getJavaTextTools
setDaemon
MessageDialogWithToggle
setTopIndex
ServiceException
getLastSegment
Te
QuickDiffRangeDifference
InputDialog
getAnnotationType
org.eclipse.jdt.internal.corext.template.java.CompilationUnitContext
ITreeContentProvider
IExpression
widgetOffset2ModelOffset
typeBounds
getMethods
align
getTextViewer
org.eclipse.jface.viewers.ILabelDecorator
getAscent
MultiTextEdit
org.eclipse.jdt.core.IPackageFragment
getDescriptors
setForegroundPattern
ICVSResource
getConfigurationElementsFor
org.eclipse.swt.widgets.IME
isSeparator
StackLayout
printIndentationIfNecessary
getErrorStream
IBuildEntry
IDiff
getDefaultInt
TransferData
setObject
getTypeSignature
org.eclipse.jface.text.source.IVerticalRulerColumn
getTag
org.eclipse.jface.dialogs.PopupDialog
RowLayout
ContentProvider
java.io.ObjectInputStream
indent
FileNotFoundException
setWorkRemaining
getDisplayName
getErrorMessage
setInTheModel
X509CertificateAttribute
getFilterControl
org.eclipse.swt.widgets.FontDialog
disposeCOMInterfaces
org.eclipse.jface.preference.FieldEditorPreferencePage
PluginSelectionDialog
saveWidgetValues
getIndent
wrap
list
handleDoubleClick
processJar
getDefinedCategoryIds
parseLong
NavigatorContentDescriptor
createCombo
getConfigDir
View
escape
getUserObject
IWizardPage
getStringVariableManager
System.out.print
getFrameworkLog
setUrl
org.eclipse.swt.internal.cocoa.NSTextFieldCell
syncExec
locationInWindow
isSimple
setNewEntries
AccessibleActionListener
consumeBinaryExpression
getLocal
asyncExec
readOffStream
ViewerFilter
MBeanOperationInfo
getTableHeightHint
getRequirements
readShort
org.eclipse.jface.viewers.ViewerComparator
setLineWidth
getAttributeValue
getCompareConfiguration
IdMap
PA
org.eclipse.jface.preference.IPreferencePage
availableRows
getExporter
readProperties
getSelectionText
getFormattedPackageName
Float
getKeySet
getMinimum
removeWidget
Action
expand
setAccessible
findType
updateLabel
org.eclipse.swt.ole.win32.OleClientSite
getThumb
isTabItem
Ma
getLocationURI
FeatureEntry
killFocus
getChild
translateXBy
doubleValue
org.eclipse.swt.internal.cocoa.NSMutableParagraphStyle
decorateText
allocate
org.eclipse.swt.internal.cocoa.NSControl
IS
KeyBinding
CoolItem
getDependencies
setInstallableUnitProfileProperty
verifyText
getTemplateData
getStateLocation
setWidthHint
isConnected
cleanup
setStatus
ItemsControl_Items
setFilterNames
arrayWithCapacity
createClient
getEnclosingType
CatchClause
findDisplay
getFeatures
htmlEncode
AccessibleTableCellEvent
org.eclipse.swt.internal.cocoa.NSComboBox
setInitialSelections
java.lang.Runtime
isProtected
CCombo
members
isListening
getProcessor
StringReader
Device
getProduct
GroupData
fillActionBars
finish
performCancel
Wo
drawPath
getDotName
getEntriesAsList
org.eclipse.ui.internal.PerspectiveBarManager
org.eclipse.swt.internal.cocoa.NSNumber
setOptional
getTypeParameters
org.eclipse.swt.internal.cocoa.WebView
addDisposeListener
contentView
AccessibleTextListener
CompilationUnitRewrite
treeExpanded
fixMnemonic
setButtonDimensionHint
org.eclipse.jface.bindings.keys.KeyBinding
FilterItem
CTabFolder
AccessRule
isLocal
isValidLocation
getEditorSite
createCoreException
TR
fillMenu
grab
org.eclipse.jface.bindings.keys.KeySequence
TeamException
org.eclipse.jface.text.ITextViewerExtension
IAntClasspathEntry
track
createEntry
createMenu
org.eclipse.ui.PartInitException
ServiceRegistration
AccessibleListener
group
isEnum
ISchedulingRule
IViewReference
getRegistry
org.eclipse.swt.widgets.Layout
fromOSString
emptyList
createFromURL
canFlipToNextPage
getPaths
getChildNodes
TreeSelection
imports
createExampleGroup
mouseDown
nextArgument
getCheckBox
V
getSchema
LabelProviderChangedEvent
setFilter
colorWithDeviceRed
ArrayContentProvider
getDisplayString
scale
java.nio.ByteBuffer
toUnencodedString
appendEscapedChar
ExecutionException
getFiles
copyToClipboard
createTable
org.eclipse.jface.text.IFindReplaceTarget
getReplacementString
newParser
updateImages
org.eclipse.swt.internal.image.PngIhdrChunk
isAnonymous
toByteArray
destroy
java.lang.Character
org.eclipse.swt.program.Program
getPreferenceManager
getColorRegistry
TextStyle
getTargets
invalidateTextPresentation
createModificationStampMap
org.eclipse.compare.CompareViewerPane
getPathLabel
getHandle
createPattern
getStyledText
IApiBaseline
sameString
end
IContextActivation
getTransfer
setWeights
showColumn
declaringType
setIncluded
getPriority
org.eclipse.swt.internal.cocoa.NSMutableAttributedString
setInstallLocation
setCompletionProposalAutoActivationCharacters
createWrapLabel
ElementTreeSelectionDialog
updateItem
getAttributeMap
XtSetValues
java.net.ServerSocket
org.eclipse.swt.examples.controlexample.ScrollableTab
previous
getAnimationShell
doRemove
handleEdit
addEventListener
org.eclipse.swt.internal.cocoa.NSScrollView
handleDispose
focusLost
org.eclipse.jface.contentassist.IContentAssistSubjectControl
getCode
org.eclipse.swt.internal.cocoa.NSColor
SearchResultViewEntry
java.io.BufferedInputStream
isExported
org.eclipse.swt.dnd.ByteArrayTransfer
getAntModel
CheckboxTableViewer
org.eclipse.swt.internal.cocoa.NSStepper
org.eclipse.swt.graphics.RGB
org.eclipse.swt.custom.TableEditor
IMethodBinding
getAnnotationPreferences
bindValue
removeSelectionListener
validatePage
exposeModelRange
org.eclipse.jface.text.source.projection.ProjectionAnnotationModel
getInstallURL
IFolder
AccessibleEditableTextListener
getWorkingCopy
AntElementNode
ImageList
createBaseline
getASTRewrite
getSectionDescriptors
getFormattedString
NSMenuItem
findElement
performStringSubstitution
selectedRowIndexes
setValid
getFastViews
getMode
IArtifactDescriptor
launch
getMainAttributes
org.eclipse.ui.dialogs.SelectionStatusDialog
getToken
getSchemeId
writeStringOrNull
getChildNodesList
setCursorPosition
tabString
getReportsRoot
position
Property
org.eclipse.ui.forms.widgets.FormText
org.eclipse.jface.viewers.ITreeSelection
ColorDialog
Command
setRequirements
setActionDefinitionId
addServiceListener
ST
Location
getXMLTagName
getTokens
JavaTextSelection
createRenameChange
AbstractTypeDeclaration
DetachedWindow
JavaElement
getCell
org.eclipse.jface.text.IInformationControl
GCData
addKeyListener
setGrayedElements
removeFilters
Pair
org.eclipse.jface.internal.provisional.action.ICoolBarManager2
getChildrenOfType
Ru
getCountry
isKindOfClass
getCommitted
getIDEImageDescriptor
JarFile
getField
addHeader
org.eclipse.jface.internal.text.link.contentassist.ContentAssistant2
extractOption
setState
setShell
getAddressableUnitPerLine
nativeToJava
createLink
UnsupportedOperationException
org.eclipse.swt.layout.FormAttachment
createColumns
getOSArch
createContext
edit
getShellStyle
createType
IThread
org.eclipse.jface.databinding.swt.IWidgetValueProperty
CVSException
getHeader
JDIThread
isArchive
org.eclipse.jface.bindings.keys.KeyStroke
getStartLevel
updateControls
hit
getErrorText
getOrigin
overlapsOrTouches
getLaunchConfigurationManager
doFillIntoGrid
hresult
getFilters
Re
org.eclipse.jface.text.BadLocationException
isInternal
CompletionProposalCategory
computeIndentUnits
hasNature
setGlobalActionHandler
searchFor
initAction
isFolder
DeleteEdit
drawBackground
getActivitySupport
renameTo
registerContextMenu
escapeSpecialChars
getTypeQualifiedName
ParameterizedCommand
printProperty
ExportPackageDescription
updateSelectionBasedEnablement
FeatureSelectionDialog
IApiComponent
getSingleSelection
treeItemChecked
XtGetValues
Mo
updateEnabledState
reverse
JavaSourceViewerConfiguration
getViewerColumn
org.eclipse.jface.text.projection.Segment
getVariable
FileReader
NavigatorContentExtension
checkValue
isMultiStatus
getRelativePath
getDataFile
deactivate
isDeprecated
getStoredValue
org.eclipse.jface.text.source.CompositeRuler
setItemCount
NSText
org.eclipse.jface.viewers.TreeSelection
org.eclipse.swt.widgets.Event
TemplateContextType
addFocusListener
java.net.MalformedURLException
org.eclipse.jface.action.ContributionManager
getRefreshTargets
testFindItem
getBundleFile
paintControl
findProgram
createTableViewer
saveGraphicsState
org.eclipse.jface.operation.IRunnableContext
createNewFile
org.eclipse.swt.internal.cocoa.NSTableHeaderView
timeZone
setMethod
org.eclipse.jface.text.TextPresentation
createRequirement
setTextLimit
IExtendedModifier
searchAllTypeNames
setActivePage
org.eclipse.jface.wizard.ProgressMonitorPart
CompositeChange
Matcher
getNodeValue
setBackgroundImage
getLineInfo
Mapping
org.eclipse.swt.internal.cocoa.NSMutableDictionary
IDocumentElementNode
getTopPixel
org.eclipse.swt.internal.cocoa.NSScroller
getInitialSize
test
NLSSubstitution
Profile
traverseReturn
parseHeader
org.eclipse.ui.internal.views.markers.MarkersTreeViewer
getLanguage
NavigationHistoryEntry
setShellSize
SourceRange
getPane
initializeFrom
org.eclipse.swt.internal.mozilla.nsIDOMEventTarget
getLocalMultiMatcherKey
getVersionConstraint
NSLayoutManager
updateEnablement
CacheInfo
org.eclipse.jface.preference.RadioGroupFieldEditor
Filter
IWorkbenchPart
sendKeyEvent
getActivityIdsForCategory
getNextEntry
closeEntry
getParentShell
focusGained
org.eclipse.jface.internal.provisional.action.IToolBarContributionItem
java.lang.ref.SoftReference
getSelectedBundles
endOfLineOf
getPluginIdentifier
adapt
org.eclipse.jface.text.templates.TemplateVariableResolver
getTextBounds
catchClauses
setStyleRanges
getSelectionIndices
removeListeners
textChanged
buildURL
java.io.ByteArrayInputStream
org.eclipse.swt.widgets.Tracker
mouseMove
fromPortableString
org.eclipse.swt.internal.cocoa.NSPrintInfo
loadImage
createButtonBar
handleAdd
ITargetPlatformService
setProvider
CompletionProposalComputerDescriptor
org.eclipse.swt.internal.theme.DrawData
IDebugTarget
resetEditors
java.net.HttpURLConnection
getTypeParameterBounds
getPackageName
java.nio.CharBuffer
setCharAt
SE
getChildCount
createStringPlaceholder
isOnDemand
createIUQuery
getStringValue
getMajor
getDirectory
getSourceAttachmentPath
org.eclipse.jface.text.source.AnnotationModelEvent
showError
calculateWidth
getOperator
addPath
org.eclipse.swt.graphics.Pattern
canEnable
org.eclipse.jface.text.IDocumentExtension4
FontDialog
getExtensionRegistry
ScopeSet
ColumnLayoutData
NSTableColumn
readConfiguration
computeCompletionProposals
org.eclipse.swt.internal.cocoa.NSText
setProperties
getFieldDecoration
extractLinkFrom
JavaCompletionProposal
copySubtrees
ProgressMonitorDialog
setClassLoader
isDefaultPackage
LinkedPositionGroup
getCursorLocation
getViewerRowFromItem
IInstallFeatureOperation
setOrigin
subSequence
ExceptionInfo
Fr
org.eclipse.jface.text.IDocumentPartitioner
compareToIgnoreCase
org.eclipse.swt.internal.cocoa.NSPopUpButton
org.eclipse.ui.IWorkbenchPart
org.eclipse.ui.views.tasklist.TaskAction
ImportDeclaration
createTextEditor
removeMnemonics
Job
getDay
getTimeStamp
VA
getPropertyValue
setInterpolation
isValidClass
addArc
getImports
TypeCompletionProposal
translateString
getProjectName
getExpandedState
ExpandableComposite
collectExpandedAndVisible
BreadcrumbItem
handleContentElements
Ar
getDefaultFont
Ac
LaunchShortcutExtension
loadProperties
deactivateHandlers
getModifierKeys
Se
DocumentEvent
move
Bu
FieldEditor
getUnderlyingType
addCheckStateListener
restore
addBinding
getTopic
FA
codeSelect
setBackgroundPixel
getTypeSetEnvironment
P_
createCompositeSetting
initWithIdentifier
disposeColors
DebugException
computeWidth
getStandardDisplay
modifierFlags
setColumnData
getMonth
getYear
ITypedRegion
getModelObject
readFile
filterItem
getTags
AccessibleActionEvent
PrintStream
LabelProvider
createClassSection
splitAndTrimOn
getJavadoc
removeFocusListener
org.eclipse.swt.custom.StyleRange
menuShell
org.eclipse.debug.internal.ui.viewers.model.provisional.TreeModelViewer
getReturnCode
tab
getAbstractVariable
setPatternItems
addResolverError
getConfiguredDocumentPartitioning
resources
setWhiteChecked
ReferenceTypeImpl
report
updateActionBars
org.eclipse.swt.internal.cocoa.NSScreen
replaceAnnotations
getContextClassLoader
IActionSetDescriptor
changesIterator
getMappings
getHighlightingColorListItem
setInformation
removeAnnotations
java.lang.management.MemoryUsage
setExitPosition
getImageBounds
org.eclipse.swt.internal.cocoa.NSAlert
getBlue
getPresentation
setForegroundColor
restoreWidgetValues
AccessibleValueEvent
Scheme
EventTable
org.osgi.framework.BundleException
getElementLabel
parseDouble
java.lang.Float
getRange
show
setup
ControlDecorator
IEditorDescriptor
createTreeViewer
setLabel
rowAtPoint
IndexEntry
TreeViewerColumn
IPackageFragmentRoot
menuShown
getVersionRange
toStringName
setPage
T1
getVariables
ClassFileReader
org.eclipse.swt.internal.ole.win32.IUnknown
doSelectionChanged
Sc
forceFocus
org.eclipse.jface.text.ITextStore
getCategories
getProjects
openURL
getExtent
type
function
computeLineHeight
getProgramArguments
org.eclipse.swt.layout.FormData
java.lang.InterruptedException
findClassLoaders
getSettingsSection
getCharacterCount
keyTraversed
unread
setSelectionBackground
NSBitmapImageRep
SearchResultGroup
unregister
getActivityManager
org.eclipse.jface.internal.text.revisions.RevisionPainter
getBlockSelection
relativize
getJob
putInt
org.eclipse.swt.internal.cocoa.NSDictionary
getActions
org.eclipse.swt.custom.CBanner
SubItemCompositeHolder
activateHandler
getDestination
newValue
removeDisposeListener
setRange
getProfile
getElementVariables
getExtensionPoints
ComboBoxCellEditor
org.eclipse.jface.viewers.IColorProvider
getComparator
digit
RandomAccessFile
getDocumentPartitioner
getWindow
getApiComponent
getComment
hide
org.eclipse.jface.internal.text.InternalAccessor
setContentType
ILogEntry
getVisibilityString
collapseToLevel
getComponentType
computeUniqueKey
IProgressMonitor
setCapabilities
org.eclipse.jface.text.contentassist.ICompletionProposal
getRectangles
URLConnection
org.eclipse.update.internal.ui.wizards.ContainerCheckedTreeViewer
createStatus
org.eclipse.jface.text.source.projection.ProjectionAnnotation
addAttribute
createSingleText
getHighlightPreferenceKey
getCursorPosition
isSingleton
getEncoding
ViewerLabel
setItemHeight
updateButtonEnablement
getMethodName
contextMenuAboutToShow
blockListeners
Task
getFactories
setShowOnlyOnFocus
getScope
serialize
isInstance
lock
appendEncodePath
updateCombo
java.nio.charset.Charset
Frame
setEntries
getChildIDFromEvent
org.eclipse.jface.text.AbstractHoverInformationControlManager
WorkbenchLabelProvider
getNextStringArg
Parameterization
org.eclipse.swt.widgets.ToolTip
SoftReference
modelOffset2WidgetOffset
reconcile
enumeration
updateData
PluginInfo
win32_new
getAPIPreferenceStore
org.eclipse.swt.internal.cocoa.NSBox
org.eclipse.jface.viewers.IStructuredContentProvider
org.eclipse.ui.actions.RetargetAction
concatWith
setReplacementOffset
IdentitySet
SearchEngine
ViewModel
setContainer
getSourceRange
getWidgetLineNumber
getOrientation
getPrefix
java.util.zip.Checksum
checkRemoved
nsEmbedCString_new
createGridLayout
getNotDeletedInfos
getNumberOfParameters
hasValueFor
rightStart
setCrc
org.eclipse.core.runtime.OperationCanceledException
IHandlerActivation
ListenerList
getBaseline
beep
createImplication
handleOpen
menuAboutToShow
getSegment
addDamagedRegion
OleAutomation
setStartLevel
centerPoint
getLauncherData
rightEnd
setSelectionForeground
openConfirm
org.eclipse.jface.text.contentassist.AdditionalInfoController
createTypeSignature
PackageEntry
ElementInfo
isTextVisible
getTracker
loadDefault
span
setInitialSelection
FieldInfo
Va
getThumbNail
initializeFilteredElements
isStatusOk
getMarkers
canHandle
setRegion
fillToolBar
getProcesses0
addVariable
org.eclipse.swt.internal.webkit.IWebFrame
newModifier
getCombinedPreferenceStore
appendTypeSignature
findModifierString
ConstraintVariable2
getMergedBundleMap
processChildren
assertIsWriteable
blit
getContextTypeRegistry
org.eclipse.jface.internal.text.source.DiffPainter
addWarning
getPaintSurface
org.eclipse.swt.internal.mozilla.nsIDOMKeyEvent
hasFatalError
TypeNameMatch
value
setHeight
free
removeElement
IMemoryRendering
getBooleanValue
ResourceComparator
setDefaultVisibleItemCount
loadAdapter
initializeValues
org.eclipse.jface.text.IFindReplaceTargetExtension
addResource
DO
parseMnemonics
compareRulerLine
TabFolder
createListDiffEntry
ModelElement
setSignature
org.eclipse.jface.text.quickassist.IQuickAssistInvocationContext
createRegion
mouseUp
debugName
java.util.jar.Attributes
removeControl
runWithException
getDevEntriesProperties
InsertEdit
getReferenceTableEntry
createArrayType
Dr
getWidget
belongsTo
org.eclipse.jface.text.source.IAnnotationAccessExtension
beginCompoundChange
isThreeWay
setCaretLocation
setIgnore
CFRelease
setIncrement
checkEnabled
doExportToDirectory
org.eclipse.swt.browser.ProgressListener
PBEKeySpec
getPreviousSibling
getTypeArguments
org.eclipse.jface.text.templates.TemplateBuffer
addField
getNoReportsInformation
isVarargs
org.eclipse.jface.text.templates.ContextTypeRegistry
org.eclipse.jface.text.source.ILineDiffer
PluginReference
startTag
getDiffTree
encodeText
java.io.OutputStreamWriter
IContentType
HistoryLabelProvider
TextCellEditor
putFields
getCu
org.eclipse.jface.text.ITextOperationTarget
node
ProvisioningContext
objectForKey
firePropertyChanged
CompilationUnitRewriteOperation
nsID
getHelpContextId
ready
setValueForArgument
getAllWorkingSets
getConfigurationWindow
addReplaceEdit
setTitleImage
setStringValue
getIU
binarySearch
processEntry
shortenText
currentEvent
IUndoableOperation
isDynamic
createControlPanel
getNamespaceIdentifier
IObservableValue
getSupplier
wait
getFileBufferListenerIterator
readObjectID
getKeySequence
toDocumentLineNumber
getInit
getManifest
removeWhiteSpaces
getDestinationType
loadConfiguration
computeInterfaceOrder
findBackgroundControl
getHelp
org.eclipse.swt.internal.ole.win32.IDataObject
getSystemFont
getMicro
T2
setExpandHorizontal
getDescriptionModel
addBundle
createEdit
doGetDelegate
newTextElement
setDirty
getRemovedKeys
checkName
intern
getProposalComputerDescriptors
getMultiMatcherKey
ITargetDefinition
getClipping
org.eclipse.swt.browser.StatusTextListener
getInputAsCompilationUnit
K
ProjectionAnnotation
ISpellDictionary
getFwJar
getOSGiInstallArea
MBeanInfo
IEditorPart
setPreferredSize
replaceOnCopy
IPresentablePart
verify
isCovered
AccessibleTableCellListener
IMemoryBlock
getWriter
prepareError
java.lang.Comparable
org.eclipse.jface.text.AbstractInformationControlManager
org.eclipse.ui.forms.widgets.Hyperlink
getOrderedColumns
NSMutableIndexSet
RECT
org.eclipse.swt.internal.ole.win32.IAccessible
ViewItem
ParticipantDescriptor
manage
setMatch
errorDialog
removeMouseListener
virtualMachineImpl
getTreePathFromItem
showURL
substituteVar
org.eclipse.jface.action.ICoolBarManager
unmodifiableSet
setHighlightRange
updateFilter
setValueOrRemove
org.eclipse.jface.dialogs.ProgressIndicator
fireChange
createJavaSearchScope
determineShouldBeAtLeastGrayChecked
isEqual
getCurrentInformationControl2
showMessage
isConflicting
validateBoolean
setPattern
IR
setCommandId
TocContribution
cancelEditing
getXMLAttributeValue
headerCell
appendQuotedString
addListeners
ScrolledComposite
linkActivated
getBase
computeSizeConstraints
getNumLines
Item
org.eclipse.equinox.p2.metadata.IInstallableUnit
isExpandable
round
setPluginId
setProfileProperty
getTimestamp
org.eclipse.jface.examples.databinding.model.Adventure
combineHashCodes
NSObject
getFromObjectTable
getNumber
getOutputLocation
JavaSourceViewer
postSetFocusOnDialogField
setOption
Choice
doUpdateItem
signature
hookListeners
textValueChanged
safeDelete
first
ContentType
setPerformActionEnabled
BooleanFieldEditor
doAdd
CriterionResource
setSorter
setRepositoryProperty
isSubtype
resize
ReferenceType
setElement
createWrappingLabel
