SN:java.lang.String
String
append:java.lang.StringBuffer
SN:INT
equals:java.lang.String
length:java.lang.String
Number
next:java.util.Iterator
hasNext:java.util.Iterator
Char
size:java.util.List
add:java.util.List
Boolean
get:java.util.Map
SN:org.eclipse.swt.layout.GridData
SN:java.lang.Object
toString:java.lang.StringBuffer
put:java.util.Map
unlock:org.eclipse.swt.internal.Lock
size:java.util.ArrayList
lock:org.eclipse.swt.internal.Lock
substring:java.lang.String
iterator:java.util.List
add:java.util.ArrayList
SN:BOOLEAN
getSelection:org.eclipse.swt.widgets.Button
indexOf:java.lang.String
get:java.util.List
iterator:java.util.Set
setLayout:org.eclipse.swt.widgets.Composite
trim:java.lang.String
println:java.io.PrintStream
exists:java.io.File
startsWith:java.lang.String
SN:org.eclipse.swt.layout.GridLayout
charAt:java.lang.String
add:java.util.Set
SN:CHAR
setSelection:org.eclipse.swt.widgets.Button
setEnabled:org.eclipse.swt.widgets.Button
equalsIgnoreCase:java.lang.String
getName:java.lang.Class
this
getText:org.eclipse.swt.widgets.Text
println:java.io.PrintWriter
isEmpty:java.util.List
size:java.util.Vector
iterator:java.util.Collection
SN:org.eclipse.swt.graphics.Color
getFont:org.eclipse.swt.widgets.Composite
get:java.util.ArrayList
size:java.util.Set
setText:org.eclipse.swt.widgets.Label
setText:org.eclipse.swt.widgets.Text
intValue:java.lang.Integer
booleanValue:java.lang.Boolean
getAbsolutePath:java.io.File
toCharArray:java.lang.String
setText:org.eclipse.swt.widgets.Button
isDisposed:org.eclipse.swt.widgets.Control
setLayoutData:org.eclipse.swt.widgets.Label
SN:org.eclipse.swt.graphics.Font
length:java.lang.StringBuffer
endsWith:java.lang.String
nextToken:java.util.StringTokenizer
lastIndexOf:java.lang.String
get:java.util.HashMap
SN:org.eclipse.swt.widgets.Composite.getFont()
contains:java.util.List
keySet:java.util.Map
setLayoutData:org.eclipse.swt.widgets.Button
equals:java.lang.Object
remove:java.util.List
remove:java.util.Map
put:java.util.HashMap
addAll:java.util.List
setLayoutData:org.eclipse.swt.widgets.Composite
contains:java.util.Set
values:java.util.Map
getDisplay:org.eclipse.swt.widgets.Shell
add:java.util.Collection
SN:org.eclipse.swt.graphics.Image
close:java.io.InputStream
elementAt:java.util.Vector
SN:BYTE
getName:java.io.File
dispose:org.eclipse.swt.graphics.Image
getValue:java.util.Map.Entry
getKey:java.util.Map.Entry
SN:org.eclipse.core.resources.IResource
Arrays.asList()
size:java.util.Collection
isDirectory:java.io.File
toArray:java.util.List
containsKey:java.util.Map
toString:java.lang.Object
dispose:org.eclipse.swt.graphics.GC
SN:java.util.List
hasMoreTokens:java.util.StringTokenizer
setLayoutData:org.eclipse.swt.widgets.Text
clear:java.util.Map
get:java.util.Hashtable
hashCode:java.lang.String
setForeground:org.eclipse.swt.graphics.GC
entrySet:java.util.Map
hasMoreElements:java.util.Enumeration
nextElement:java.util.Enumeration
SN:java.lang.Class
readInt:java.io.DataInputStream
add:java.util.HashSet
size:java.util.Map
isDisposed:org.eclipse.swt.widgets.Shell
getClass:java.lang.Object
getString:java.util.ResourceBundle
addAll:java.util.Set
getText:org.eclipse.swt.widgets.Combo
print:java.io.PrintWriter
delete:java.io.File
iterator:java.util.ArrayList
SN:org.eclipse.swt.graphics.Point
toArray:java.util.ArrayList
setFont:org.eclipse.swt.widgets.Composite
getAddress:org.eclipse.swt.internal.Callback
toExternalForm:java.net.URL
replace:java.lang.String
getBytes:java.lang.String
addSelectionListener:org.eclipse.swt.widgets.Button
clear:java.util.List
SN:org.eclipse.swt.events.SelectionListener
toLowerCase:java.lang.String
SN:java.lang.String.substring()
setBackground:org.eclipse.swt.graphics.GC
SN:java.util.Set
remove:java.util.Iterator
dispose:org.eclipse.swt.graphics.Color
getFile:java.net.URL
getBounds:org.eclipse.swt.graphics.Image
getProperty:java.util.Properties
isEmpty:java.util.Set
getParentFile:java.io.File
NLS.bind()
SN:java.io.File
getDisplay:org.eclipse.swt.widgets.Control
put:java.util.Hashtable
SN:org.eclipse.core.runtime.IPath
equals:java.lang.Class
SN:java.lang.String.length()
setLayoutData:org.eclipse.swt.widgets.Control
layout:org.eclipse.swt.widgets.Composite
getItemCount:org.eclipse.swt.widgets.Table
ControlExample.getResourceString()
SN:org.eclipse.jdt.core.IJavaElement
remove:java.util.Set
mkdirs:java.io.File
contains:java.util.ArrayList
setFont:org.eclipse.swt.widgets.Label
setFont:org.eclipse.swt.widgets.Button
SN:org.eclipse.swt.graphics.Rectangle
put:java.util.Properties
isFile:java.io.File
remove:java.util.ArrayList
select:org.eclipse.swt.widgets.Combo
SN:org.eclipse.jdt.core.IType
getTargetException:java.lang.reflect.InvocationTargetException
print:java.io.PrintStream
getShell:org.eclipse.swt.widgets.Control
setFont:org.eclipse.swt.graphics.GC
isDisposed:org.eclipse.swt.graphics.Image
append:java.lang.StringBuilder
write:java.io.OutputStream
SN:org.eclipse.jdt.core.IJavaProject
getData:org.eclipse.swt.widgets.TableItem
setEnabled:org.eclipse.swt.widgets.Text
getMessage:java.lang.Throwable
SN:org.eclipse.jdt.core.ICompilationUnit
read:java.io.InputStream
getDisplay:org.eclipse.swt.widgets.Composite
isEmpty:java.util.Map
getChars:java.lang.String
SN:org.eclipse.swt.widgets.Menu
toString:java.lang.Boolean
toArray:java.util.Set
SN:org.eclipse.swt.widgets.Control
write:java.io.Writer
getPath:java.io.File
getChildren:org.eclipse.swt.widgets.Composite
setText:org.eclipse.swt.widgets.Group
isEmpty:java.util.ArrayList
getProtocol:java.net.URL
addElement:java.util.Vector
SN:java.lang.StringBuffer.toString()
setRedraw:org.eclipse.swt.widgets.Control
indexOf:java.util.List
getSelectionIndex:org.eclipse.swt.widgets.Combo
SN:org.eclipse.core.resources.IProject
contains:java.util.Collection
getRGB:org.eclipse.swt.graphics.Color
getData:org.eclipse.swt.widgets.TreeItem
SN:java.lang.Runnable
setFocus:org.eclipse.swt.widgets.Text
SN:org.eclipse.swt.widgets.Display.getSystemColor()
contains:java.util.HashSet
size:java.util.HashSet
init:org.eclipse.swt.internal.cocoa.NSObject
setText:org.eclipse.swt.widgets.MenuItem
SN:java.lang.Integer
toURI:java.io.File
printStackTrace:java.io.IOException
setText:org.eclipse.swt.widgets.Shell
getParent:org.eclipse.swt.widgets.Control
setText:org.eclipse.swt.widgets.Combo
SN:org.eclipse.swt.internal.cocoa.NSString
contains:org.eclipse.swt.graphics.Rectangle
toURL:java.io.File
compareTo:java.lang.String
SN:java.util.Collection
readUTF:java.io.DataInputStream
getItem:org.eclipse.swt.widgets.Table
setFocus:org.eclipse.swt.widgets.Control
toUpperCase:java.lang.String
Messages.bind()
isDisposed:org.eclipse.swt.graphics.Color
getShell:org.eclipse.swt.widgets.Composite
SN:java.util.Iterator.next()
close:java.io.OutputStream
remove:java.util.HashMap
getMessage:java.lang.Exception
SN:org.eclipse.core.resources.IFile
readAndDispatch:org.eclipse.swt.widgets.Display
writeInt:java.io.DataOutputStream
getResourceString()
run:java.lang.Runnable
SN:org.eclipse.equinox.p2.metadata.IInstallableUnit
getDisplay:org.eclipse.swt.browser.Browser
split:java.lang.String
setVisible:org.eclipse.swt.widgets.Control
openStream:java.net.URL
setLength:java.lang.StringBuffer
setLayoutData:org.eclipse.swt.widgets.Table
dispose:org.eclipse.swt.internal.Callback
lastModified:java.io.File
clear:java.util.Set
getFontMetrics:org.eclipse.swt.graphics.GC
add:java.util.Vector
toString:java.net.URI
getSeverityString()
toString:java.lang.Integer
sleep:org.eclipse.swt.widgets.Display
isDisposed:org.eclipse.swt.widgets.TreeItem
setEnabled:org.eclipse.swt.widgets.Label
SN:org.eclipse.swt.layout.FormData
clear:java.util.ArrayList
listFiles:java.io.File
SN:org.eclipse.swt.widgets.Button.getSelection()
getLayoutData:org.eclipse.swt.widgets.Control
isEmpty:java.util.Collection
isDisposed:org.eclipse.swt.widgets.Display
load:java.util.Properties
getScheme:java.net.URI
readLine:java.io.BufferedReader
getText:org.eclipse.swt.widgets.TableItem
add:org.eclipse.swt.widgets.Combo
values:java.util.HashMap
open:org.eclipse.swt.widgets.FileDialog
isDisposed:org.eclipse.swt.widgets.Menu
addAll:java.util.ArrayList
setEnabled:org.eclipse.swt.widgets.Control
getSelectionIndex:org.eclipse.swt.widgets.Table
SN:org.eclipse.swt.dnd.TransferData
getMessage:java.io.IOException
alloc:org.eclipse.swt.internal.cocoa.NSAutoreleasePool
SN:java.util.Map
SN:java.util.ResourceBundle.getString()
toString:java.net.URL
getAddress:org.eclipse.swt.internal.mozilla.XPCOMObject
longValue:java.lang.Long
dispose:org.eclipse.swt.widgets.Menu
get:java.util.Properties
getFocusControl:org.eclipse.swt.widgets.Display
SN:java.math.BigInteger
toArray:java.util.Collection
keySet:java.util.HashMap
get:java.util.Vector
SN:org.eclipse.osgi.service.resolver.BundleDescription
getItems:org.eclipse.swt.widgets.Table
iterator:java.util.HashSet
SN:java.util.ArrayList
release:org.eclipse.swt.internal.cocoa.NSAutoreleasePool
SN:org.eclipse.swt.internal.cocoa.NSPoint
SN:org.eclipse.jdt.core.dom.ASTNode
stringExtent:org.eclipse.swt.graphics.GC
dispose:org.eclipse.swt.graphics.Font
Integer.toString()
getColumnCount:org.eclipse.swt.widgets.Table
hashCode:java.lang.Object
getLayout:org.eclipse.swt.widgets.Composite
getSelection:org.eclipse.swt.widgets.Table
open:org.eclipse.swt.widgets.Shell
SN:org.eclipse.swt.events.SelectionAdapter
SN:org.eclipse.swt.graphics.Cursor
SN:java.io.InputStream
SN:org.eclipse.swt.widgets.Event
dispose:org.eclipse.swt.widgets.Shell
getAddress:org.eclipse.swt.internal.ole.win32.COMObject
redraw:org.eclipse.swt.widgets.Canvas
SN:org.eclipse.ui.IWorkingSet
dispose:org.eclipse.swt.browser.Browser
printStackTrace:java.lang.Throwable
SN:java.net.URI
getName:java.util.zip.ZipEntry
containsKey:java.util.HashMap
setLayoutData:org.eclipse.swt.widgets.Combo
toString:java.lang.RuntimeException
beep:org.eclipse.swt.widgets.Display
setSize:org.eclipse.swt.widgets.Shell
getSize:org.eclipse.swt.widgets.Shell
setWarnings:org.eclipse.swt.widgets.Display
SN:java.util.Map.get()
setFont:org.eclipse.swt.widgets.Text
setToolTipText:org.eclipse.swt.widgets.ToolItem
setEnabled:org.eclipse.swt.widgets.Combo
getMessage:org.eclipse.core.runtime.CoreException
getActiveShell:org.eclipse.swt.widgets.Display
setText:org.eclipse.swt.widgets.TableItem
setLayout:org.eclipse.swt.widgets.Group
getClientArea:org.eclipse.swt.widgets.Composite
setLayoutData:org.eclipse.ui.forms.widgets.Section
addModifyListener:org.eclipse.swt.widgets.Text
getData:org.eclipse.swt.widgets.Widget
SN:org.eclipse.swt.accessibility.AccessibleTextEvent
get:java.lang.ThreadLocal
length:org.eclipse.swt.internal.win32.TCHAR
write:java.io.BufferedWriter
SN:org.eclipse.swt.events.ModifyListener
getPath:java.net.URL
setHeaderVisible:org.eclipse.swt.widgets.Table
dispose:org.eclipse.swt.ole.win32.Variant
SN:java.util.zip.ZipEntry
replaceAll:java.lang.String
getFontData:org.eclipse.swt.graphics.Font
isDisposed:org.eclipse.swt.graphics.GC
SN:LONG
toString:java.io.File
getParent:org.eclipse.swt.widgets.Composite
size:java.util.HashMap
getData:org.eclipse.swt.widgets.Display
SN:org.eclipse.pde.core.plugin.IPluginModelBase
setImage:org.eclipse.swt.widgets.Label
setItems:org.eclipse.swt.widgets.Combo
getString:org.eclipse.swt.internal.cocoa.NSString
SN:org.eclipse.swt.accessibility.AccessibleControlEvent
getSource:org.eclipse.debug.core.DebugEvent
getItems:org.eclipse.swt.widgets.Tree
getCanonicalPath:java.io.File
toString:java.io.StringWriter
SN:org.eclipse.swt.widgets.TreeItem
countTokens:java.util.StringTokenizer
SN:org.eclipse.swt.internal.cocoa.NSRect
String.valueOf()
SN:org.eclipse.jface.util.PropertyChangeEvent.getProperty()
remove:java.util.Hashtable
SN:org.eclipse.jdt.core.IPackageFragment
isInstance:java.lang.Class
setLayoutData:org.eclipse.swt.widgets.Group
indexOf:org.eclipse.swt.widgets.Table
getBounds:org.eclipse.swt.widgets.Control
equals:org.eclipse.jdt.core.ICompilationUnit
clear:java.util.HashMap
setWidth:org.eclipse.swt.widgets.TableColumn
isDisposed:org.eclipse.swt.graphics.Font
getSelection:org.eclipse.swt.widgets.Spinner
isDisposed:org.eclipse.swt.widgets.Button
start:java.lang.Thread
isDisposed:org.eclipse.swt.widgets.Widget
SN:org.eclipse.swt.widgets.Composite
listIterator:java.util.List
SN:org.eclipse.jdt.internal.ui.text.correction.proposals.ASTRewriteCorrectionProposal
peek:java.util.Stack
SN:org.eclipse.jdt.internal.ui.wizards.buildpaths.CPListElement
setBackground:org.eclipse.swt.widgets.Composite
getParentItem:org.eclipse.swt.widgets.TreeItem
setProperty:java.util.Properties
GraphicsExample.getResourceString()
setBounds:org.eclipse.swt.widgets.Control
getSelection:org.eclipse.swt.widgets.ScrollBar
fillRectangle:org.eclipse.swt.graphics.GC
close:java.io.BufferedReader
SN:java.net.URL
SN:org.eclipse.swt.widgets.Button
setEditable:org.eclipse.swt.widgets.Text
textExtent:org.eclipse.swt.graphics.GC
get:java.util.Dictionary
addWidget:org.eclipse.swt.widgets.Display
equals:java.io.File
flush:java.io.PrintWriter
dispose:org.eclipse.swt.widgets.Control
put:java.util.Dictionary
SN:org.eclipse.swt.widgets.TableItem
SN:FLOAT
SN:org.eclipse.jdt.core.dom.ITypeBinding
pop:java.util.Stack
getShell:org.eclipse.swt.browser.Browser
SN:java.util.StringTokenizer.nextToken()
isDisposed:org.eclipse.swt.browser.Browser
setVisible:org.eclipse.swt.widgets.Shell
checkData:org.eclipse.swt.widgets.Table
SN:org.eclipse.core.runtime.IStatus
removeWidget:org.eclipse.swt.widgets.Display
getBounds:org.eclipse.swt.widgets.Shell
readBoolean:java.io.DataInputStream
writeUTF:java.io.DataOutputStream
indexOf:java.util.ArrayList
pack:org.eclipse.swt.widgets.Shell
selectAll:org.eclipse.swt.widgets.Text
getDisplay:org.eclipse.swt.custom.StyledText
equals:org.eclipse.jdt.core.IJavaElement
getHeight:org.eclipse.swt.graphics.FontMetrics
setSelection:org.eclipse.swt.widgets.ScrollBar
insert:java.lang.StringBuffer
remove:java.util.Properties
setVisible:org.eclipse.swt.widgets.Menu
toByteArray:java.io.ByteArrayOutputStream
SN:org.eclipse.jdt.core.IClasspathEntry
close:java.io.FileOutputStream
SN:org.osgi.framework.Bundle
asyncExec:org.eclipse.swt.widgets.Display
getParent:java.io.File
SN:org.eclipse.jface.resource.ImageDescriptor
setClipping:org.eclipse.swt.graphics.GC
setSelection:org.eclipse.swt.widgets.Table
SN:org.eclipse.text.edits.TextEdit
hasNext:java.util.ListIterator
getImageData:org.eclipse.swt.graphics.Image
setVisible:org.eclipse.swt.widgets.Composite
list:java.io.File
printStackTrace:java.lang.Exception
SN:java.net.URL.getProtocol()
SN:org.eclipse.jface.text.Position
close:java.util.zip.ZipFile
matcher:java.util.regex.Pattern
SN:org.eclipse.ui.forms.widgets.TableWrapData
compareTo:java.math.BigInteger
dispose:org.eclipse.swt.graphics.Cursor
dispose:org.eclipse.swt.widgets.Display
next:java.util.ListIterator
SN:org.eclipse.swt.widgets.Listener
readByte:java.io.DataInputStream
close:java.io.PrintWriter
isAbsolute:java.io.File
SN:org.eclipse.core.runtime.IConfigurationElement
drawImage:org.eclipse.swt.graphics.GC
dispose:org.eclipse.swt.widgets.Composite
getLineCount:org.eclipse.swt.custom.StyledTextContent
equals:org.eclipse.swt.graphics.Font
getColumn:org.eclipse.swt.widgets.Table
SN:org.eclipse.jface.action.IContributionItem
FormLayoutFactory.createSectionClientGridLayout()
equals:org.eclipse.jdt.core.IType
dispose:org.eclipse.swt.dnd.Clipboard
set:java.util.List
setControl:org.eclipse.swt.widgets.TabItem
BigInteger.valueOf()
isDisposed:org.eclipse.swt.widgets.Composite
setSelection:org.eclipse.swt.widgets.Spinner
setImage:org.eclipse.swt.widgets.ToolItem
SN:org.eclipse.jdt.internal.compiler.lookup.TypeBinding
getFont()
isDisposed:org.eclipse.swt.widgets.TableItem
setText:org.eclipse.swt.widgets.Item
SN:org.eclipse.swt.accessibility.AccessibleTableEvent
SN:org.eclipse.swt.graphics.Path
SN:org.osgi.framework.ServiceReference
SN:java.util.List.get()
SN:org.eclipse.jdt.core.IMethod
equals:org.eclipse.swt.graphics.Color
regionMatches:java.lang.String
getBackground()
removeElement:java.util.Vector
SN:org.eclipse.swt.graphics.RGB
checkData:org.eclipse.swt.widgets.Tree
keys:java.util.Hashtable
getItems:org.eclipse.swt.widgets.TreeItem
getColumnCount:org.eclipse.swt.widgets.Tree
write:java.io.ByteArrayOutputStream
addAll:java.util.Collection
setFont:org.eclipse.swt.widgets.Table
isEmpty:java.util.Vector
indexOf:org.eclipse.swt.widgets.Combo
SN:org.eclipse.core.runtime.IConfigurationElement.getName()
close:java.io.FileInputStream
SN:org.eclipse.pde.internal.core.text.IDocumentElementNode
readLong:java.io.DataInputStream
SN:org.eclipse.swt.events.DisposeListener
getTime:java.util.Date
ASTNode.copySubtrees()
SWT.getMessage()
setImage:org.eclipse.swt.widgets.Button
setImage:org.eclipse.swt.widgets.TableItem
open:org.eclipse.swt.widgets.DirectoryDialog
isDisposed:org.eclipse.swt.custom.StyledText
length:java.io.File
SN:java.util.Map.Entry.getKey()
SN:org.eclipse.swt.graphics.GC
getWidget:org.eclipse.swt.widgets.Display
elements:java.util.Hashtable
getData:org.eclipse.swt.widgets.Item
SN:org.eclipse.swt.widgets.Shell
close:java.io.DataInputStream
setImage:org.eclipse.swt.widgets.Item
setBackground:org.eclipse.swt.widgets.Label
getSource:org.eclipse.jface.util.PropertyChangeEvent
objectAtIndex:org.eclipse.swt.internal.cocoa.NSArray
JFaceResources.getDialogFont()
drawLine:org.eclipse.swt.graphics.GC
SN:org.eclipse.swt.graphics.Rectangle.SN:INT
size:java.util.LinkedList
setRedraw:org.eclipse.swt.widgets.Tree
getBounds:org.eclipse.swt.widgets.TableItem
SN:org.eclipse.jface.text.source.Annotation
getModifiers:java.lang.reflect.Field
isDisposed:org.eclipse.swt.widgets.TableColumn
getThread:org.eclipse.swt.widgets.Display
setText:org.eclipse.swt.widgets.ToolItem
getItemCount:org.eclipse.swt.widgets.Tree
open:org.eclipse.swt.widgets.MessageBox
SN:org.eclipse.jdt.core.IMember
setEnabled:org.eclipse.swt.widgets.ToolItem
indexOf:org.eclipse.swt.widgets.Tree
toString:java.lang.String
getItemHeight:org.eclipse.swt.widgets.Table
NSString.stringWith()
SN:org.eclipse.debug.core.model.IBreakpoint
toString:java.util.Locale
setForeground:org.eclipse.swt.widgets.Label
dispose:org.eclipse.swt.internal.mozilla.XPCOMObject
SN:org.eclipse.core.runtime.IPath.segment()
getBounds:org.eclipse.swt.graphics.TextLayout
push:java.util.Stack
getItems:org.eclipse.swt.widgets.Combo
SN:org.eclipse.swt.widgets.Text
getSelection:org.eclipse.swt.widgets.Tree
contains:java.util.Vector
releaseHandle:org.eclipse.swt.widgets.Item
setFocus:org.eclipse.swt.widgets.Table
setLinesVisible:org.eclipse.swt.widgets.Table
SN:org.eclipse.debug.core.ILaunchConfiguration
getOffsetAtLine:org.eclipse.swt.custom.StyledTextContent
setResizable:org.eclipse.swt.widgets.TableColumn
getLayoutData:org.eclipse.swt.widgets.Button
isDisposed:org.eclipse.swt.widgets.TreeColumn
getSize:org.eclipse.swt.widgets.Control
isEmpty:java.util.Stack
read:org.eclipse.swt.internal.image.LEDataInputStream
removeAll:java.util.Set
interrupt:java.lang.Thread
SN:org.eclipse.swt.custom.StyleRange
SN:org.eclipse.swt.internal.cocoa.NSRange
setFilterPath:org.eclipse.swt.widgets.FileDialog
Math.max()
getInputStream:java.util.zip.ZipFile
copyInto:java.util.Vector
getCause:java.lang.reflect.InvocationTargetException
SN:java.lang.Thread
releaseWidget:org.eclipse.swt.widgets.Item
getName:java.lang.Thread
setLayoutData:org.eclipse.swt.widgets.Tree
getSelection:org.eclipse.swt.widgets.MenuItem
getClassLoader:java.lang.Class
getData:org.eclipse.swt.widgets.Control
getBackground:org.eclipse.swt.widgets.Composite
charAt:java.lang.StringBuffer
dispose:org.eclipse.swt.ole.win32.OleAutomation
remove:java.util.Vector
remove:java.util.HashSet
close:org.eclipse.swt.widgets.Shell
createNewFile:java.io.File
newInstance:java.lang.Class
putAll:java.util.Map
SN:org.eclipse.core.resources.IMarker
dispose:org.eclipse.swt.graphics.Path
Messages.format()
setFilterPath:org.eclipse.swt.widgets.DirectoryDialog
renameTo:java.io.File
compare:java.util.Comparator
getWarnings:org.eclipse.swt.widgets.Display
isDisposed:org.eclipse.swt.graphics.Region
SN:org.eclipse.update.core.IFeature
loadClass:java.lang.ClassLoader
isEnabled:org.eclipse.swt.widgets.Button
getDisplay:org.eclipse.swt.widgets.Text
getDisplay:org.eclipse.swt.widgets.Table
getBounds:org.eclipse.swt.widgets.Monitor
releaseWidget:org.eclipse.swt.widgets.Widget
setFont:org.eclipse.swt.widgets.Control
addAll:java.util.HashSet
System.getProperty()
SN:org.eclipse.swt.graphics.Region
removeAll:java.util.List
getContents:org.eclipse.swt.dnd.Clipboard
redraw:org.eclipse.swt.examples.graphics.GraphicsExample
SN:java.net.URI.getScheme()
getItemCount:org.eclipse.swt.widgets.Combo
setFont:org.eclipse.swt.custom.StyledText
toString:java.math.BigInteger
SN:java.lang.StringBuffer
syncExec:org.eclipse.swt.widgets.Display
openConnection:java.net.URL
isDisposed:org.eclipse.swt.widgets.Tree
getHeight:org.eclipse.swt.graphics.FontData
setVisible:org.eclipse.swt.widgets.Label
remove:java.util.Collection
close:java.io.DataOutputStream
containsKey:java.util.Properties
getLocalizedMessage:java.io.IOException
setLocation:org.eclipse.swt.widgets.Shell
isEmpty:java.util.HashSet
SN:org.eclipse.core.resources.IContainer
SN:org.eclipse.jface.viewers.TableLayout
SN:org.eclipse.swt.widgets.Decorations
toString:java.lang.Throwable
setSelection:org.eclipse.swt.widgets.MenuItem
clear:java.util.Collection
setText:org.eclipse.swt.custom.CLabel
SN:java.lang.String.lastIndexOf()
dispose:org.eclipse.swt.internal.ole.win32.COMObject
isEditable()
isDisposed:org.eclipse.swt.widgets.Table
setLayoutData:org.eclipse.swt.widgets.Link
Math.min()
getName()
getChars:java.lang.StringBuffer
getSelection:org.eclipse.swt.custom.StyledText
SN:org.eclipse.ui.Saveable
SN:org.eclipse.jdt.core.dom.Expression
setText:org.eclipse.swt.widgets.Link
SN:org.eclipse.osgi.internal.module.ResolverBundle
SN:org.eclipse.ui.IWorkbenchPart
setMenu:org.eclipse.swt.widgets.Control
SN:java.lang.String.indexOf()
getBounds:org.eclipse.swt.widgets.TreeItem
getLayoutData:org.eclipse.swt.widgets.Text
getSystemColor:org.eclipse.swt.widgets.Display
SN:org.eclipse.swt.graphics.Pattern
SN:org.eclipse.swt.widgets.Display
containsKey:java.util.Hashtable
getForeground()
getDisplay:org.eclipse.swt.widgets.Tree
LayoutExample.getResourceString()
SN:java.lang.ClassLoader
getLineHeight:org.eclipse.swt.custom.StyledTextRenderer
getPath:java.net.URI
find:java.util.regex.Matcher
releaseChildren:org.eclipse.swt.widgets.Composite
count:org.eclipse.swt.internal.cocoa.NSArray
getItem:org.eclipse.swt.widgets.Combo
setLayout:org.eclipse.swt.widgets.Table
isDisposed:org.eclipse.swt.widgets.Text
hasMoreElements:java.util.StringTokenizer
entrySet:java.util.HashMap
reskinChildren:org.eclipse.swt.widgets.Composite
mkdir:java.io.File
setContextClassLoader:java.lang.Thread
getDevice:org.eclipse.swt.graphics.GC
SN:java.util.HashSet
matches:java.util.regex.Matcher
getEntry:java.util.zip.ZipFile
setThumb:org.eclipse.swt.widgets.ScrollBar
_getChildren:org.eclipse.swt.widgets.Composite
add:org.eclipse.swt.widgets.ImageList
getSchemeSpecificPart:java.net.URI
isVisible:org.eclipse.swt.widgets.Shell
pack:org.eclipse.swt.widgets.TableColumn
SN:java.lang.String.getBytes()
setData:org.eclipse.swt.widgets.TableItem
getX:org.eclipse.swt.examples.accessibility.CTableColumn
setRedraw:org.eclipse.swt.widgets.Composite
getExpanded:org.eclipse.swt.widgets.TreeItem
setLayout:org.eclipse.swt.widgets.Shell
getResourceAsStream:java.lang.Class
openTD()
setMessage:org.eclipse.swt.widgets.MessageBox
writeByte:java.io.DataOutputStream
subtract:java.math.BigInteger
getLocation:org.eclipse.swt.widgets.Shell
toString:org.eclipse.swt.internal.win32.TCHAR
SN:org.eclipse.jdt.internal.ui.preferences.OptionsConfigurationBlock.Key
SN:org.eclipse.swt.dnd.Transfer
disposeTextLayout:org.eclipse.swt.custom.StyledTextRenderer
SN:org.eclipse.swt.graphics.TextLayout
layout:org.eclipse.swt.widgets.Shell
getCaretOffset:org.eclipse.swt.custom.StyledText
set:java.lang.ThreadLocal
isDisposed:org.eclipse.swt.widgets.ToolItem
getMessage:java.lang.reflect.InvocationTargetException
getSize:org.eclipse.swt.widgets.Canvas
saveGraphicsState:org.eclipse.swt.internal.cocoa.NSGraphicsContext
getProperty:org.eclipse.swt.ole.win32.OleAutomation
SN:org.eclipse.jdt.launching.IVMInstall
removeAll:org.eclipse.swt.widgets.Table
setFocus:org.eclipse.swt.widgets.Caret
getCursorLocation:org.eclipse.swt.widgets.Display
equals:org.eclipse.jdt.core.IJavaProject
getItemCount:org.eclipse.swt.widgets.TreeItem
getChecked:org.eclipse.swt.widgets.TreeItem
entries:java.util.zip.ZipFile
getLineHeight:org.eclipse.swt.custom.StyledText
getAddress:org.eclipse.swt.internal.mozilla.nsEmbedString
getItems:org.eclipse.swt.widgets.Menu
getLineAtOffset:org.eclipse.swt.custom.StyledTextContent
read:java.io.Reader
getChecked:org.eclipse.swt.widgets.TableItem
getStyle:org.eclipse.swt.examples.accessibility.CTable
getText:org.eclipse.swt.accessibility.AccessibleTextExtendedListener
isDisposed:org.eclipse.swt.widgets.MenuItem
SN:org.eclipse.jdt.internal.corext.refactoring.typeconstraints.types.TType
getShell:org.eclipse.swt.widgets.Button
getSelectionIndex:org.eclipse.swt.widgets.List
getTextLayout:org.eclipse.swt.custom.StyledTextRenderer
getStyle:org.eclipse.swt.widgets.Text
setText:org.eclipse.swt.widgets.TableColumn
SN:org.eclipse.debug.core.ILaunchConfiguration.getAttribute()
setMenu:org.eclipse.swt.widgets.MenuItem
getClientArea:org.eclipse.swt.widgets.Canvas
equals:org.eclipse.jdt.internal.ui.preferences.OptionsConfigurationBlock.Key
getType:org.eclipse.swt.ole.win32.Variant
getData:org.eclipse.swt.widgets.Shell
getValue()
releaseParent:org.eclipse.swt.widgets.Widget
findWidget:org.eclipse.swt.widgets.Display
getHost:java.net.URL
available:java.io.InputStream
clear:java.util.HashSet
getData:org.eclipse.swt.widgets.Button
compareToIgnoreCase:java.lang.String
getData:org.eclipse.swt.widgets.MenuItem
dispose:org.eclipse.swt.internal.mozilla.nsEmbedString
setPageIncrement:org.eclipse.swt.widgets.ScrollBar
SN:org.eclipse.swt.widgets.Composite.getBackground()
add:java.util.LinkedList
getMainAttributes:java.util.jar.Manifest
size:java.util.Properties
length:org.eclipse.swt.internal.cocoa.NSString
getLocalizedMessage:org.eclipse.core.runtime.CoreException
setBackground:org.eclipse.swt.widgets.Canvas
SN:org.eclipse.debug.internal.ui.viewers.model.provisional.IPresentationContext.getId()
setBounds:org.eclipse.swt.widgets.Shell
setMaximum:org.eclipse.swt.widgets.ScrollBar
SN:org.eclipse.jface.preference.IPreferenceStore.getDefaultBoolean()
isEmpty:java.util.LinkedList
addSelectionListener:org.eclipse.swt.widgets.Combo
clear:java.util.Hashtable
getBgColor1:org.eclipse.swt.examples.graphics.GraphicsBackground
close:java.io.Reader
SN:org.eclipse.core.resources.mapping.ResourceMapping
SN:java.lang.String.toLowerCase()
setSelection:org.eclipse.swt.custom.CTabFolder
getItem:org.eclipse.swt.widgets.Tree
getStyle:org.eclipse.swt.widgets.Composite
setFont:org.eclipse.swt.widgets.Combo
SN:org.eclipse.ui.IWorkbenchWindow
SN:org.eclipse.ui.views.markers.internal.MarkerType
setFocus:org.eclipse.swt.widgets.Tree
getShells:org.eclipse.swt.widgets.Display
getName:org.eclipse.swt.graphics.FontData
isPrimitive:java.lang.Class
addAccessibleListener:org.eclipse.swt.accessibility.Accessible
isArray:java.lang.Class
setModalDialog:org.eclipse.swt.widgets.Display
setText:org.eclipse.swt.custom.StyledText
SN:org.eclipse.ui.internal.registry.IActionSetDescriptor
getItems:org.eclipse.swt.widgets.ToolBar
restoreGraphicsState:org.eclipse.swt.internal.cocoa.NSGraphicsContext
getLayoutData:org.eclipse.swt.widgets.Composite
SN:org.eclipse.jdt.launching.IRuntimeClasspathEntry
isDisposed:org.eclipse.swt.widgets.Canvas
equals:java.net.URI
setCursor:org.eclipse.swt.widgets.Canvas
setImage:org.eclipse.swt.custom.CLabel
ASTNodeFactory.newModifiers()
indexOf:java.lang.StringBuffer
getCanonicalFile:java.io.File
setDefaultButton:org.eclipse.swt.widgets.Shell
getBounds:org.eclipse.swt.widgets.ToolItem
setFocus:org.eclipse.swt.widgets.Combo
computeSize:org.eclipse.swt.widgets.Control
SN:org.eclipse.debug.core.model.IDebugTarget
SN:org.eclipse.swt.graphics.Point.SN:INT
SN:org.eclipse.swt.accessibility.AccessibleAdapter
killFocus:org.eclipse.swt.widgets.Caret
SN:org.eclipse.pde.api.tools.internal.provisional.model.IApiComponent
equals:org.eclipse.swt.graphics.Image
writeBoolean:java.io.DataOutputStream
unhook:org.eclipse.swt.widgets.EventTable
SN:org.eclipse.ui.internal.registry.EditorDescriptor
dispose:org.eclipse.swt.graphics.Transform
get:java.util.TreeMap
SN:org.eclipse.debug.core.model.IMemoryBlock
setText:org.eclipse.swt.graphics.TextLayout
SN:org.eclipse.swt.events.MouseListener
SN:java.util.jar.JarEntry
get:java.lang.ref.SoftReference
add:java.math.BigInteger
SN:org.eclipse.swt.graphics.Device.getSystemColor()
getAverageCharWidth:org.eclipse.swt.graphics.FontMetrics
SN:org.eclipse.jface.text.IDocument
insert:org.eclipse.swt.widgets.Text
removeFirst:java.util.LinkedList
getThumbNail:org.eclipse.swt.examples.graphics.GraphicsBackground
previous:java.util.ListIterator
add:java.util.SortedSet
timerExec:org.eclipse.swt.widgets.Display
setFileName:org.eclipse.swt.widgets.FileDialog
SN:org.eclipse.jdt.internal.ui.preferences.formatter.LineWrappingTabPage.Category
SN:org.eclipse.jdt.core.IField
write:org.eclipse.swt.internal.image.LEDataOutputStream
SN:org.eclipse.equinox.frameworkadmin.BundleInfo
SN:org.eclipse.jdi.internal.request.EventRequestImpl.requestID()
keys:java.util.Properties
SN:org.eclipse.core.runtime.IConfigurationElement.getAttribute()
size:java.util.Hashtable
intValue:java.lang.Double
clone:java.lang.Object
addObject:org.eclipse.swt.internal.cocoa.NSMutableArray
SN:org.eclipse.core.runtime.IPath.toOSString()
addSelectionListener:org.eclipse.swt.widgets.Spinner
flush:java.io.OutputStream
setChecked:org.eclipse.swt.widgets.TableItem
SN:org.eclipse.ui.internal.keys.model.BindingElement
getImage:org.eclipse.swt.widgets.Item
Utils.getPropertyFormat()
SN:org.eclipse.jface.bindings.Binding
SN:org.eclipse.swt.examples.graphics.GraphicsBackground.getThumbNail()
setFocus:org.eclipse.swt.widgets.Button
getCharCount:org.eclipse.swt.custom.StyledText
getTransparencyType:org.eclipse.swt.graphics.ImageData
setDaemon:java.lang.Thread
setVisible:org.eclipse.swt.widgets.ToolBar
getLine:org.eclipse.swt.custom.StyledTextContent
setChecked:org.eclipse.swt.widgets.TreeItem
getColumns:org.eclipse.swt.widgets.Table
getClientArea:org.eclipse.swt.widgets.Monitor
setTransform:org.eclipse.swt.graphics.GC
SN:org.eclipse.swt.graphics.Transform
SN:org.eclipse.swt.widgets.TableItem.getText()
getTransparencyMask:org.eclipse.swt.graphics.ImageData
Signature.toString()
setGrayed:org.eclipse.swt.widgets.TreeItem
isAssignableFrom:java.lang.Class
setBackground:org.eclipse.swt.widgets.Text
getName:java.lang.reflect.Method
release:org.eclipse.swt.widgets.TableItem
SN:org.eclipse.equinox.internal.ds.model.ServiceComponentProp
convert()
getName:java.lang.reflect.Field
getBounds:org.eclipse.swt.widgets.Display
removeControl:org.eclipse.swt.widgets.Composite
SN:org.eclipse.swt.internal.cocoa.NSSize
releaseWidget:org.eclipse.swt.widgets.Control
set:java.util.ArrayList
SN:org.eclipse.ui.console.IConsole
setLineWidth:org.eclipse.swt.graphics.GC
SN:org.eclipse.jdt.core.dom.ITypeBinding.getName()
SN:org.eclipse.core.runtime.IPath.toString()
setVisible:org.eclipse.swt.widgets.Button
isAbsolute:java.net.URI
SN:org.eclipse.jface.action.IAction
SN:java.util.Map.Entry.getValue()
size:java.util.Stack
dispose:org.eclipse.swt.widgets.Text
close:java.io.BufferedWriter
setLayoutData:org.eclipse.swt.custom.SashForm
SN:org.eclipse.jdt.core.dom.IVariableBinding
toString:java.lang.StringBuilder
toString:java.lang.CharSequence
SN:org.eclipse.jdt.core.IPackageFragmentRoot
indexOf:org.eclipse.swt.widgets.ImageList
setRedraw:org.eclipse.swt.widgets.Table
setVisible:org.eclipse.swt.widgets.ScrollBar
SN:org.eclipse.jdt.core.dom.IMethodBinding
fillPolygon:org.eclipse.swt.graphics.GC
register:org.eclipse.swt.widgets.Composite
isDisposed:org.eclipse.swt.graphics.Cursor
append:org.eclipse.swt.widgets.Text
getBuffer:java.io.StringWriter
SN:org.eclipse.team.internal.ccvs.core.ICVSRepositoryLocation
getMessage:org.eclipse.ui.PartInitException
getImage:org.eclipse.swt.widgets.TableItem
getItem:org.eclipse.swt.widgets.Menu
indexOf:org.eclipse.swt.widgets.TabFolder
SN:java.util.HashMap
wait:java.lang.Object
setHeaderVisible:org.eclipse.swt.widgets.Tree
releaseWidget:org.eclipse.swt.widgets.Composite
getInt:org.eclipse.swt.ole.win32.Variant
canWrite:java.io.File
intern:java.lang.String
getByteOrder:org.eclipse.swt.graphics.ImageData
RemoteAntMessages.getString()
setText:org.eclipse.swt.widgets.TreeItem
getForeground:org.eclipse.swt.graphics.GC
write:java.io.FileWriter
setVisible:org.eclipse.swt.custom.TableCursor
SN:CHAR.SN:INT
SN:java.lang.Object.toString()
write:java.io.FileOutputStream
getBoolean:org.eclipse.swt.ole.win32.Variant
getName:java.util.jar.JarEntry
checkAdvancedGraphics:org.eclipse.swt.examples.graphics.GraphicsExample
dispose:org.eclipse.swt.graphics.Region
SN:org.eclipse.swt.widgets.Spinner.getSelection()
SN:org.eclipse.swt.internal.cocoa.NSColor
matches:java.lang.String
store:java.util.Properties
length:java.lang.CharSequence
SN:org.eclipse.jdt.core.dom.SimpleName
dispose:org.eclipse.swt.graphics.TextLayout
SN:org.eclipse.jface.preference.IPreferenceStore.getBoolean()
close:java.io.ByteArrayInputStream
remove:java.util.ListIterator
SN:org.eclipse.swt.widgets.Text.getText()
setForeground:org.eclipse.swt.widgets.Composite
charValue:java.lang.Character
SN:org.eclipse.osgi.service.resolver.BundleDescription.getSymbolicName()
SN:org.eclipse.jface.bindings.TriggerSequence
setFocus:org.eclipse.swt.widgets.Composite
isFocusCaret:org.eclipse.swt.widgets.Caret
SN:org.eclipse.core.resources.IResource.getProject()
getColumns:org.eclipse.swt.widgets.Tree
getEnabled:org.eclipse.swt.widgets.Button
SN:org.eclipse.core.runtime.CoreException.getStatus()
writeLong:java.io.DataOutputStream
getParent:org.eclipse.swt.widgets.Shell
keySet:java.util.Properties
SN:org.eclipse.debug.core.ILaunch
setEnabled:org.eclipse.swt.widgets.Table
Long.toString()
equals:org.eclipse.jdt.core.IPackageFragment
write:java.io.StringWriter
isDirectory:java.util.zip.ZipEntry
type:org.eclipse.swt.internal.cocoa.NSEvent
clone:java.util.ArrayList
getClass:java.lang.Throwable
filters:org.eclipse.swt.widgets.Display
invoke:java.lang.reflect.Method
close:java.io.Writer
SN:java.util.ArrayList.get()
Messages.getString()
drawString:org.eclipse.swt.graphics.GC
group:java.util.regex.Matcher
SN:java.io.File.getAbsolutePath()
getShell:org.eclipse.swt.custom.StyledText
SN:java.io.PrintStream
SN:java.lang.String.equals()
getTypeName()
containsAll:java.util.Set
setBackground:org.eclipse.swt.widgets.Control
isVisible:org.eclipse.swt.widgets.Canvas
getParent:org.eclipse.swt.widgets.TreeItem
equals:org.eclipse.equinox.p2.metadata.Version
SN:org.eclipse.team.core.synchronize.SyncInfo
indexOf:java.util.Vector
getDisplay:org.eclipse.swt.widgets.Canvas
hasPrevious:java.util.ListIterator
floatValue:java.lang.Float
setMaximum:org.eclipse.swt.widgets.Spinner
hookEvents:org.eclipse.swt.widgets.Composite
SN:org.eclipse.ui.IEditorDescriptor
SN:org.eclipse.swt.dnd.DropTargetEvent
flush:java.io.BufferedWriter
deregister:org.eclipse.swt.widgets.Composite
FormLayoutFactory.createFormGridLayout()
getMonitor:org.eclipse.swt.widgets.Shell
SN:org.eclipse.swt.widgets.Event.SN:INT
setLayoutData:org.eclipse.swt.widgets.List
SN:org.eclipse.swt.ole.win32.OleListener
Platform.getDebugOption()
setBackgroundPattern:org.eclipse.swt.graphics.GC
Compatibility.getMessage()
SN:org.eclipse.jdt.core.dom.SingleVariableDeclaration
SN:java.util.List.size()
write:java.io.DataOutputStream
intValue:org.eclipse.swt.internal.cocoa.NSNumber
getStyle:org.eclipse.swt.widgets.Shell
SN:java.lang.String.trim()
getSelectionIndices:org.eclipse.swt.widgets.Table
deleteOnExit:java.io.File
createGridData()
setBackground:org.eclipse.swt.custom.StyledText
getColumn:org.eclipse.swt.widgets.Tree
getSuperclass:java.lang.Class
sendEvent:org.eclipse.swt.widgets.EventTable
setFont:org.eclipse.swt.widgets.Group
SN:org.eclipse.ui.contexts.IContextActivation
compareTo:org.eclipse.equinox.p2.metadata.Version
cell:org.eclipse.swt.internal.cocoa.NSTextField
getText:org.eclipse.swt.widgets.Item
getString()
SN:org.eclipse.swt.events.FocusListener
getBounds:org.eclipse.swt.widgets.Composite
getSize:org.eclipse.swt.widgets.ScrollBar
SN:java.lang.String.charAt()
isEnabled:org.eclipse.swt.widgets.Control
getFilterPath:org.eclipse.swt.widgets.FileDialog
getWidth:org.eclipse.swt.widgets.TableColumn
SN:org.eclipse.core.runtime.IStatus.getMessage()
getRole:org.eclipse.swt.accessibility.AccessibleControlListener
_getTabList:org.eclipse.swt.widgets.Composite
SN:org.eclipse.jdt.core.IMethod.getElementName()
toString:java.io.ByteArrayOutputStream
getClientArea:org.eclipse.swt.custom.StyledText
SN:org.eclipse.swt.internal.mozilla.nsEmbedString.getAddress()
SN:java.util.Date
SN:org.eclipse.swt.internal.mozilla.XPCOMObject.getAddress()
getRGBs:org.eclipse.swt.graphics.PaletteData
SN:org.eclipse.jface.dialogs.IDialogSettings.getBoolean()
topHandle:org.eclipse.swt.widgets.Control
hashCode:java.lang.Class
SN:org.eclipse.swt.events.TraverseListener
SN:org.eclipse.swt.browser.ProgressEvent
modifierFlags:org.eclipse.swt.internal.cocoa.NSEvent
SN:org.eclipse.core.resources.IResource.getName()
toArray:java.util.HashSet
iterator:java.util.SortedSet
getControl:org.eclipse.swt.widgets.TabItem
open:org.eclipse.swt.widgets.ColorDialog
add:org.eclipse.swt.graphics.Region
toURL:java.net.URI
SN:org.eclipse.search.ui.text.Match
getModalDialog:org.eclipse.swt.widgets.Display
getContextClassLoader:java.lang.Thread
equals:org.eclipse.jface.viewers.ISelection
read:java.io.BufferedReader
isEnabled()
releaseParent:org.eclipse.swt.widgets.Item
getName:java.util.zip.ZipFile
setContent:org.eclipse.swt.custom.ScrolledComposite
getSelectionCount:org.eclipse.swt.widgets.Table
SN:org.eclipse.swt.widgets.Combo.getText()
close:java.io.StringWriter
SN:org.eclipse.jdt.internal.corext.refactoring.ParameterInfo
close:java.io.RandomAccessFile
getSelectionIndex:org.eclipse.swt.widgets.TabFolder
update:org.eclipse.swt.widgets.Canvas
SN:org.eclipse.jdt.core.IType.getFullyQualifiedName()
setItems:org.eclipse.swt.widgets.List
changed:org.eclipse.swt.browser.StatusTextListener
SN:org.eclipse.swt.browser.StatusTextEvent
getWidth:org.eclipse.swt.widgets.TreeColumn
dispose:org.eclipse.swt.widgets.TreeItem
clone:org.eclipse.swt.custom.StyleRange
getItemHeight:org.eclipse.swt.widgets.Tree
SN:org.eclipse.core.runtime.IAdaptable
setAccessible:java.lang.reflect.Method
getText:org.eclipse.swt.custom.CCombo
getSize:org.eclipse.swt.widgets.Composite
equals:org.eclipse.swt.graphics.RGB
isSupportedType:org.eclipse.swt.dnd.Transfer
keys:java.util.Dictionary
close:java.io.ByteArrayOutputStream
cell:org.eclipse.swt.internal.cocoa.NSControl
keyCode:org.eclipse.swt.internal.cocoa.NSEvent
SN:org.eclipse.equinox.p2.metadata.IInstallableUnit.getId()
dispose:org.eclipse.swt.widgets.TableItem
drawPath:org.eclipse.swt.graphics.GC
isEnabled:org.eclipse.swt.widgets.Menu
getParent:org.eclipse.swt.widgets.Button
toString:org.eclipse.swt.widgets.Event
release:org.eclipse.swt.internal.cocoa.NSString
SN:org.eclipse.equinox.p2.metadata.expression.IExpression
getFD:java.io.FileOutputStream
doubleValue:java.lang.Number
SN:org.eclipse.jdt.core.dom.ITypeBinding.getQualifiedName()
dispose:org.eclipse.swt.widgets.ImageList
iterator:java.util.Vector
clear:java.util.Vector
alloc:org.eclipse.swt.internal.cocoa.NSString
IDEWorkbenchPlugin.getIDEImageDescriptor()
getFont:org.eclipse.swt.custom.StyledText
createWidget:org.eclipse.swt.widgets.Composite
getStyle:org.eclipse.swt.graphics.FontData
SN:org.eclipse.swt.widgets.Combo.indexOf()
SN:org.eclipse.equinox.p2.metadata.Version
getVisible:org.eclipse.swt.widgets.Canvas
SN:org.eclipse.ui.internal.LayoutPart
Thread.currentThread()
getSelectionIndex:org.eclipse.swt.custom.CTabFolder
release:org.eclipse.swt.internal.cocoa.NSAttributedString
getInterfaces:java.lang.Class
listIterator:java.util.ArrayList
reskin:org.eclipse.swt.widgets.Menu
releaseHandle:org.eclipse.swt.widgets.Composite
getStyle:org.eclipse.swt.widgets.Control
getTopIndex:org.eclipse.swt.widgets.Table
getAutomation:org.eclipse.swt.ole.win32.Variant
setImage:org.eclipse.swt.widgets.TreeItem
SN:java.net.URL.toExternalForm()
addSelectionListener:org.eclipse.swt.widgets.TableColumn
Util.translateString()
setRedraw:org.eclipse.swt.custom.StyledText
SN:org.eclipse.swt.events.KeyListener
SN:org.eclipse.jface.text.IDocument.get()
SN:org.eclipse.swt.widgets.MenuItem
iterator:java.util.LinkedList
hook:org.eclipse.swt.widgets.EventTable
setVisibleItemCount:org.eclipse.swt.widgets.Combo
SN:org.eclipse.osgi.framework.internal.core.BundleContextImpl
cellSize:org.eclipse.swt.internal.cocoa.NSCell
SN:org.eclipse.jdt.core.dom.VariableDeclarationFragment
SN:org.eclipse.jdt.internal.ui.text.correction.proposals.LinkedCorrectionProposal
SN:org.eclipse.ui.IWorkingSet.getId()
isDisposed:org.eclipse.swt.graphics.Transform
getBgImage:org.eclipse.swt.examples.graphics.GraphicsBackground
setData:org.eclipse.swt.widgets.TreeItem
setToolTipText:org.eclipse.swt.widgets.Button
getText:org.eclipse.swt.widgets.Label
getLocalizedMessage:java.lang.Throwable
indexOf:org.eclipse.swt.widgets.TreeItem
setText:org.eclipse.swt.widgets.MessageBox
SN:org.eclipse.jdt.core.dom.Statement
getGCData:org.eclipse.swt.graphics.GC
SN:java.io.PrintWriter
SN:org.eclipse.jdt.core.IJavaProject.getOption()
setExpanded:org.eclipse.swt.widgets.TreeItem
SN:java.lang.Long
SN:java.util.Hashtable
addFirst:java.util.LinkedList
setRGB:org.eclipse.swt.widgets.ColorDialog
getFont:org.eclipse.swt.widgets.TreeItem
SN:org.eclipse.jface.viewers.TreePath
getDisplay:org.eclipse.swt.widgets.Widget
dispose:org.eclipse.swt.widgets.Item
SN:org.eclipse.team.internal.ccvs.core.CVSTag
SN:org.eclipse.core.commands.operations.IUndoableOperation
setMinimum:org.eclipse.swt.widgets.Spinner
SN:org.eclipse.swt.browser.WindowEvent
SN:org.eclipse.swt.widgets.ToolBar
setSelection:org.eclipse.swt.widgets.Text
getVisible:org.eclipse.swt.widgets.Control
getClientArea()
close:java.util.jar.JarFile
getInputStream:java.net.URLConnection
newLine:java.io.BufferedWriter
getSystemColor:org.eclipse.swt.graphics.Device
getParent:org.eclipse.swt.widgets.Label
indexOf:org.eclipse.swt.widgets.Menu
getStyle:org.eclipse.swt.widgets.Table
printStackTrace:java.io.FileNotFoundException
getLocationAtOffset:org.eclipse.swt.custom.StyledText
setCursor:org.eclipse.swt.widgets.Shell
SN:org.eclipse.swt.widgets.TreeColumn
SN:org.eclipse.ui.IEditorInput
setData:org.eclipse.swt.widgets.Button
isVisible:org.eclipse.swt.widgets.Control
setEnabled:org.eclipse.swt.widgets.Tree
setEnabled:org.eclipse.swt.widgets.ScrollBar
OlePlugin.getResourceString()
SN:org.eclipse.equinox.p2.engine.IProfile
setData:org.eclipse.swt.widgets.MenuItem
getHelpListener()
getMessage:org.eclipse.core.commands.ExecutionException
setFocus:org.eclipse.swt.custom.StyledText
SN:org.eclipse.jdt.core.dom.IBinding
SN:org.eclipse.jdt.internal.compiler.apt.util.ManyToMany.T1
isDisposed:org.eclipse.swt.widgets.ToolBar
SN:org.eclipse.equinox.p2.metadata.IArtifactKey
equals:org.eclipse.swt.graphics.Point
notifyListeners:org.eclipse.swt.browser.Browser
redraw:org.eclipse.swt.widgets.Composite
setCursor:org.eclipse.swt.widgets.ToolBar
setLinesVisible:org.eclipse.swt.widgets.Tree
getSelection:org.eclipse.swt.widgets.Combo
SN:org.eclipse.swt.internal.cocoa.NSTextContainer
SN:org.eclipse.ui.IEditorPart
isTabItem:org.eclipse.swt.widgets.Control
replaceFirst:java.lang.String
getSelection:org.eclipse.swt.widgets.Text
notifyAll:java.lang.Object
SN:org.eclipse.core.runtime.jobs.Job
getLocalizedMessage:java.lang.Exception
SN:org.eclipse.ui.forms.widgets.TableWrapLayout
getDisplay:org.eclipse.swt.custom.CTabFolder
isTabGroup:org.eclipse.swt.widgets.Control
getKey()
setBackground:org.eclipse.swt.widgets.ToolBar
getNameText:org.eclipse.swt.widgets.Item
JFaceResources.getString()
getStyle:org.eclipse.swt.widgets.Widget
getInputStream:java.util.jar.JarFile
doubleValue:java.lang.Double
getPort:java.net.URL
SN:org.eclipse.swt.browser.LocationEvent
MessageUtil.getString()
SN:java.util.Properties.getProperty()
SN:org.eclipse.ui.handlers.IHandlerActivation
exec:java.lang.Runtime
getDisplay:org.eclipse.ui.forms.widgets.Section
dispose:org.eclipse.swt.widgets.MenuItem
SN:org.eclipse.jdt.internal.core.JavaProject
isEmpty:java.util.HashMap
equals:org.eclipse.swt.graphics.Rectangle
getMessage:org.eclipse.core.runtime.OperationCanceledException
setData:org.eclipse.swt.widgets.TabItem
returnClassName()
getHeaderHeight:org.eclipse.swt.widgets.Table
SN:org.eclipse.debug.core.sourcelookup.ISourceContainer
SN:org.eclipse.ui.ISourceProvider
writeInt:org.eclipse.swt.internal.image.LEDataOutputStream
getShell:org.eclipse.swt.widgets.Table
SN:SHORT
putNextEntry:java.util.jar.JarOutputStream
setImage:org.eclipse.swt.widgets.MenuItem
locationInWindow:org.eclipse.swt.internal.cocoa.NSEvent
setEnabled:org.eclipse.swt.widgets.MenuItem
SN:org.eclipse.swt.widgets.TableColumn
SN:org.eclipse.jdt.core.dom.Name
getFont:org.eclipse.swt.widgets.Control
setSelection:org.eclipse.swt.widgets.ToolItem
SN:org.eclipse.team.ui.synchronize.ISynchronizeModelElement
SN:org.eclipse.jface.viewers.ISelection
SN:org.eclipse.equinox.p2.metadata.IInstallableUnit.getVersion()
getOrigin:org.eclipse.swt.custom.ScrolledComposite
setWidth:org.eclipse.swt.widgets.TreeColumn
concat:java.lang.String
SN:org.eclipse.swt.events.ControlListener
getVisible:org.eclipse.swt.widgets.ScrollBar
getClientArea:org.eclipse.swt.widgets.Shell
SN:org.eclipse.swt.accessibility.AccessibleActionEvent
SN:org.eclipse.osgi.internal.resolver.BundleDescriptionImpl
SN:org.eclipse.pde.internal.core.ischema.ISchemaObject
getCaret:org.eclipse.swt.widgets.Canvas
SN:org.eclipse.jface.util.IPropertyChangeListener
cell:org.eclipse.swt.internal.cocoa.NSButton
SN:org.eclipse.ui.IPerspectiveDescriptor
SN:org.eclipse.swt.custom.StackLayout
hookEvents:org.eclipse.swt.widgets.Item
selectionChanged:org.eclipse.swt.accessibility.Accessible
SN:org.eclipse.compare.examples.xml.IdMap.getName()
setFont:org.eclipse.swt.widgets.Tree
SN:org.eclipse.swt.custom.CTabFolder
setData:org.eclipse.swt.widgets.Composite
put:java.util.TreeMap
getText:org.eclipse.swt.widgets.TreeItem
createGridLayout()
SN:org.eclipse.jdt.core.IType.getElementName()
start:java.util.regex.Matcher
contentView:org.eclipse.swt.internal.cocoa.NSWindow
getMethod:java.lang.Class
isFocusControl:org.eclipse.swt.widgets.Control
SN:java.io.FileInputStream
checkData:org.eclipse.swt.examples.accessibility.CTable
getAbsoluteFile:java.io.File
getLayoutData:org.eclipse.swt.widgets.Label
setFocus:org.eclipse.swt.widgets.Shell
Release:org.eclipse.swt.internal.mozilla.nsIServiceManager
getText:org.eclipse.swt.widgets.Shell
getSelectionRange:org.eclipse.swt.custom.StyledText
releaseHandle:org.eclipse.swt.widgets.Widget
getGrayed:org.eclipse.swt.widgets.TreeItem
add:java.util.TreeSet
getTopPixel:org.eclipse.swt.custom.StyledText
addEventListener:org.eclipse.swt.browser.WebSite
getParameterTypes:java.lang.reflect.Method
getAvailableTypes:org.eclipse.swt.dnd.Clipboard
getCharCount:org.eclipse.swt.custom.StyledTextContent
setEditor:org.eclipse.swt.custom.TableEditor
SN:org.eclipse.ui.internal.navigator.extensions.NavigatorContentDescriptor
waitFor:java.lang.Process
getMaximum:org.eclipse.swt.widgets.ScrollBar
SN:org.eclipse.jdt.internal.corext.refactoring.typeconstraints.ConstraintVariable
setToolTipText:org.eclipse.swt.widgets.Label
SN:org.eclipse.jdt.internal.ui.text.correction.proposals.FixCorrectionProposal
SN:org.eclipse.jface.viewers.ISelectionChangedListener
SN:org.eclipse.jface.text.contentassist.ICompletionProposal
getAddress:org.eclipse.swt.accessibility.Accessible
getClipping:org.eclipse.swt.graphics.GC
equals:org.eclipse.debug.core.model.IDebugTarget
getData:org.eclipse.swt.widgets.Composite
isEmpty:org.eclipse.swt.graphics.Rectangle
equals:java.lang.Boolean
setLayoutData:org.eclipse.swt.widgets.Canvas
drawPolyline:org.eclipse.swt.graphics.GC
SN:org.eclipse.swt.widgets.Label
SN:org.eclipse.swt.graphics.GCData
javaToNative:org.eclipse.swt.dnd.ByteArrayTransfer
flushCache:org.eclipse.swt.widgets.Layout
SN:org.eclipse.swt.accessibility.Accessible
getEventListener:org.eclipse.swt.dnd.DNDListener
hooks:org.eclipse.swt.widgets.EventTable
setAlpha:org.eclipse.swt.graphics.GC
SN:java.util.Enumeration.nextElement()
getClientArea:org.eclipse.swt.widgets.Table
relayout:org.eclipse.swt.widgets.ToolBar
SN:org.eclipse.jdt.core.dom.AST.newExpressionStatement()
SN:org.eclipse.swt.widgets.Combo.getItem()
clear:org.eclipse.swt.widgets.TreeItem
computeTabList:org.eclipse.swt.widgets.Control
getData:org.eclipse.jdt.internal.ui.javaeditor.breadcrumb.BreadcrumbItem
SN:org.eclipse.swt.graphics.ImageData.SN:INT
isDisposed:org.eclipse.swt.widgets.Label
SN:org.eclipse.jdt.apt.core.internal.util.ManyToMany.T1
setLayoutData:org.eclipse.swt.widgets.ToolBar
setForeground:org.eclipse.swt.widgets.Control
setExampleWidgetState:org.eclipse.swt.examples.controlexample.Tab
SN:org.eclipse.ui.IWorkingSet.getName()
SN:org.eclipse.equinox.p2.repository.artifact.IArtifactDescriptor
SN:org.eclipse.jdt.internal.ui.preferences.formatter.WhiteSpaceOptions.InnerNode
SN:org.eclipse.jdt.core.dom.Type
update:org.eclipse.swt.widgets.Display
fillPath:org.eclipse.swt.graphics.GC
SN:org.eclipse.swt.internal.cocoa.NSAttributedString
SN:org.eclipse.jdt.internal.debug.core.model.JDIDebugTarget
SN:java.util.Properties
flush:java.io.FileOutputStream
getMessage:java.lang.IllegalArgumentException
setResizable:org.eclipse.swt.widgets.TreeColumn
SN:org.eclipse.jdt.internal.ui.wizards.dialogfields.TreeListDialogField.E
getTimeInMillis:java.util.Calendar
SN:java.lang.Object.getClass()
values:java.util.Hashtable
select:org.eclipse.swt.widgets.List
toArray:java.util.Vector
getName:org.eclipse.swt.program.Program
getShell:org.eclipse.swt.widgets.Text
