SN:java.lang.String
String
append
SN:INT
equals
size
add
get
length
Number
next
Boolean
hasNext
iterator
Char
toString
put
SN:java.lang.Object
setText
getSelection
dispose
setLayoutData
isDisposed
SN:org.eclipse.swt.layout.GridData
remove
isEmpty
SN:BOOLEAN
indexOf
setEnabled
println
unlock
lock
substring
getName
getText
contains
close
setSelection
setLayout
getOffset
setFont
getDisplay
trim
startsWith
exists
charAt
toArray
clear
getLength
this
open
SN:org.eclipse.swt.layout.GridLayout
SN:CHAR
getControl
addAll
getShell
getMessage
getFont
getData
intValue
equalsIgnoreCase
SN:org.eclipse.swt.graphics.Color
hashCode
getBounds
getFirstElement
keySet
write
booleanValue
setVisible
getClass
getAbsolutePath
setBackground
values
nextToken
setFocus
endsWith
getProperty
SN:org.eclipse.swt.graphics.Font
getAddress
containsKey
toCharArray
lastIndexOf
getParent
setForeground
getTable
SN:org.eclipse.swt.widgets.Composite.getFont()
getString
refresh
getValue
SN:org.eclipse.swt.graphics.Image
release
print
elementAt
setImage
SN:BYTE
SN:org.eclipse.swt.widgets.Composite
printStackTrace
getKey
setInput
SN:org.eclipse.core.resources.IResource
Arrays.asList()
isDirectory
addSelectionListener
getItems
getStyle
getItemCount
hasMoreElements
entrySet
replace
SN:java.util.List
getTree
read
isEnabled
hasMoreTokens
nextElement
getBoolean
readInt
getDocument
getSelectionIndex
setRedraw
SN:java.lang.Class
getTextWidget
delete
getItem
run
SN:org.eclipse.swt.graphics.Point
getSize
setData
getPath
alloc
SN:org.eclipse.jface.action.Action
setChecked
setDefault
layout
SN:org.eclipse.swt.events.SelectionListener
NLS.bind()
Release
compareTo
getLayoutData
getClientArea
toExternalForm
SN:java.lang.String.substring()
getBytes
redraw
update
toLowerCase
SN:java.util.Set
getChildren
getParentFile
getFile
set
select
SN:java.lang.String.length()
SN:java.io.File
removeAll
setToolTipText
SN:org.eclipse.core.runtime.IPath
SN:org.eclipse.swt.graphics.Rectangle
ControlExample.getResourceString()
SN:org.eclipse.jdt.core.IJavaElement
getSource
flush
SN:org.eclipse.swt.widgets.Control
getLocalizedMessage
addElement
mkdirs
getImage
init
isFile
getChars
SN:org.eclipse.jface.resource.ImageDescriptor
getInt
SN:java.lang.StringBuffer.toString()
SN:org.eclipse.swt.widgets.Button.getSelection()
SN:org.eclipse.jdt.core.IType
SN:org.eclipse.jface.util.IPropertyChangeListener
getBackground
createImage
getRGB
SN:org.eclipse.jdt.core.IJavaProject
getTargetException
create
getType
releaseWidget
setValue
createDialogArea
SN:org.eclipse.swt.widgets.Shell
SN:java.lang.Runnable
getInput
getSection
SN:org.eclipse.jdt.core.ICompilationUnit
getColumnCount
setBounds
SN:org.eclipse.core.resources.IProject
toURL
getLineOfOffset
load
setSize
writeInt
getChecked
toURI
SN:java.util.Iterator.next()
getId
pack
SN:org.eclipse.jface.text.IDocument
setMenu
isVisible
setContentProvider
getProtocol
SN:java.lang.Integer
Messages.bind()
SN:org.eclipse.swt.internal.cocoa.NSString
SN:org.eclipse.swt.widgets.Display.getSystemColor()
SN:java.util.Collection
keys
getChar
SN:org.eclipse.swt.widgets.Menu
addNewSection
readUTF
getImageData
setLabelProvider
setEditable
start
getNewValue
SN:org.eclipse.jface.text.source.Annotation
readAndDispatch
SN:org.eclipse.core.resources.IFile
checkData
configureShell
setLength
SN:org.eclipse.equinox.p2.metadata.IInstallableUnit
okPressed
getResourceString()
split
setImageDescriptor
getElement
getColumn
toList
getInputStream
lastModified
readLine
setWidth
toUpperCase
getScheme
clone
setMessage
removePropertyChangeListener
getLineOffset
openStream
sleep
getFontMetrics
getSeverityString()
addSelectionChangedListener
SN:org.eclipse.jface.text.Position
listFiles
setHeaderVisible
longValue
setItems
SN:java.util.Map
getForeground
createControl
getHeight
addPropertyChangeListener
SN:org.eclipse.swt.layout.FormData
getCheckedElements
SN:java.util.ResourceBundle.getString()
SN:org.eclipse.swt.widgets.Event
SN:org.eclipse.osgi.service.resolver.BundleDescription
releaseHandle
reskin
getLayout
setCursor
SN:java.math.BigInteger
SN:org.eclipse.jdt.core.dom.ASTNode
SN:org.eclipse.swt.dnd.TransferData
addModifyListener
SN:org.eclipse.jface.viewers.ISelection
SN:org.eclipse.jface.action.IAction
setControl
SN:LONG
getFocusControl
SN:org.eclipse.jface.action.IContributionItem
Integer.toString()
insert
SN:org.eclipse.pde.core.plugin.IPluginModelBase
SN:org.eclipse.jface.text.IRegion.getOffset()
elements
getNumberOfLines
listIterator
isChecked
setWarnings
SN:java.util.ArrayList
createContextMenu
setFilterPath
stringExtent
appendToGroup
reskinChildren
getLineInformation
getAccessible
SN:java.net.URI
releaseChildren
replaceAll
SN:org.eclipse.swt.accessibility.AccessibleTextEvent
getEnabled
SN:org.eclipse.ui.IWorkingSet
register
SN:org.eclipse.swt.events.SelectionAdapter
SN:java.io.InputStream
SN:org.eclipse.swt.graphics.Cursor
setProperty
getLastSegment
SN:org.eclipse.swt.graphics.RGB
SN:java.util.zip.ZipEntry
getFontData
matches
getVisible
isAbsolute
SN:org.eclipse.swt.events.ModifyListener
SN:org.eclipse.jface.viewers.ISelectionChangedListener
SN:java.util.Map.get()
SN:org.eclipse.swt.internal.cocoa.NSPoint
countTokens
getActiveShell
getWidth
getLocation
setAllChecked
getLineCount
SN:org.osgi.framework.Bundle
SN:org.eclipse.jdt.core.IPackageFragment
hookEvents
beep
getItemHeight
SN:org.eclipse.swt.accessibility.AccessibleControlEvent
deregister
SN:org.eclipse.swt.widgets.Button
getReturnCode
applyTo
SN:org.eclipse.jface.util.PropertyChangeEvent.getProperty()
getTime
getCanonicalPath
SN:org.eclipse.jface.text.IRegion.getLength()
selectAll
String.valueOf()
find
getContentProvider
computeSize
isInstance
writeUTF
SN:org.eclipse.core.runtime.IStatus
readByte
performDefaults
isFocusControl
cell
addFilter
getParentItem
peek
SN:org.eclipse.jface.operation.IRunnableWithProgress
removeElement
SN:org.eclipse.jdt.internal.ui.text.correction.proposals.ASTRewriteCorrectionProposal
isEditable()
fillRectangle
setLocation
performOk
setLinesVisible
asyncExec
SN:org.eclipse.swt.internal.cocoa.NSRect
setDisabledImageDescriptor
getLineHeight
SN:org.eclipse.swt.widgets.TreeItem
compare
SN:org.eclipse.jdt.internal.ui.wizards.buildpaths.CPListElement
readBoolean
getLineInformationOfOffset
getCause
SN:java.net.URL
getSegmentCount
count
removeSelectionChangedListener
setMaximum
AddRef
matcher
SN:org.eclipse.text.edits.TextEdit
SN:org.eclipse.jdt.core.dom.ITypeBinding
getStartLine
SN:java.util.StringTokenizer.nextToken()
setRemoveAllWhenShown
pop
GraphicsExample.getResourceString()
computeTrim
SN:org.osgi.framework.ServiceReference
SN:org.eclipse.swt.graphics.GC
setClipping
SN:org.eclipse.jdt.core.IClasspathEntry
getSelectedRange
textExtent
setResizable
drawImage
topHandle
SN:org.eclipse.swt.widgets.TableItem
SN:org.eclipse.ui.forms.widgets.TableWrapData
convertWidthInCharsToPixels
SN:org.eclipse.swt.accessibility.AccessibleTableEvent
setCheckedElements
SN:FLOAT
removeListener
setGrayed
SN:java.util.List.get()
getBackground()
getOffsetAtLine
putAll
getPosition
doubleValue
setComparator
push
getArray
getModifiers
SN:org.eclipse.jface.viewers.ViewerFilter
getFont()
FormLayoutFactory.createSectionClientGridLayout()
SN:org.eclipse.jdt.core.IMethod
addListener
SN:org.eclipse.pde.internal.core.text.IDocumentElementNode
toByteArray
SN:org.eclipse.ui.actions.ActionFactory.IWorkbenchAction
SN:org.eclipse.swt.custom.StyleRange
getElements
BigInteger.valueOf()
SN:org.eclipse.swt.widgets.Text
objectAtIndex
readLong
changed
SN:org.eclipse.debug.core.ILaunchConfiguration
SN:java.util.Map.Entry.getKey()
newInstance
list
wait
setContent
SN:org.eclipse.jdt.internal.compiler.lookup.TypeBinding
setToDefault
SN:org.eclipse.swt.graphics.Path
syncExec
SN:org.eclipse.swt.events.DisposeListener
MessageFormat.format()
getSelectionCount
ASTNode.copySubtrees()
SN:org.eclipse.jface.viewers.TreePath
SN:org.eclipse.core.runtime.IConfigurationElement
getCharCount
setUseHashlookup
NSString.stringWith()
propertyChange
SN:org.eclipse.jface.util.PropertyChangeEvent
SN:org.eclipse.swt.widgets.Listener
releaseParent
SN:org.eclipse.swt.graphics.Rectangle.SN:INT
getDevice
copyInto
regionMatches
addMouseListener
getHeaderHeight
initCause
frame
buttonPressed
isSupportedType
retain
reset
SN:org.eclipse.jface.action.MenuManager
SN:org.eclipse.swt.dnd.Transfer
getLineLength
JFaceResources.getDialogFont()
interrupt
SN:org.eclipse.jface.viewers.ILabelProviderListener
loadClass
SWT.getMessage()
SN:org.eclipse.debug.core.model.IBreakpoint
SN:org.eclipse.core.runtime.IConfigurationElement.getName()
openConnection
SN:org.eclipse.jdt.core.IMember
format
getVerticalBar
setTitle
SN:org.eclipse.core.runtime.IPath.segment()
setDocument
writeByte
getColumns
getAnnotationIterator
drawLine
Math.max()
unread
SN:org.eclipse.swt.internal.cocoa.NSRange
getClassLoader
SN:org.eclipse.jface.text.ITextViewer
getSystemColor
SN:org.eclipse.jface.viewers.ILabelProvider
getParameterizedCommand
SN:org.eclipse.swt.graphics.Region
containsAll
getResourceAsStream
getHost
addPages
getThread
SN:org.eclipse.swt.widgets.Display
getCaretOffset
getContents
SN:org.eclipse.update.core.IFeature
store
getExpanded
setPageIncrement
expandToLevel
toDisplay
SN:org.eclipse.core.resources.IContainer
destroyItem
getCurrentPage
notifyAll
SN:java.lang.Thread
setContextClassLoader
getElementAt
isDeleted
getContextTypeId
getLabelProvider
getLineDelimiter
getNextPage
getEntry
install
entries
SN:java.lang.String.lastIndexOf()
SN:java.lang.ClassLoader
getLineAtOffset
convertHeightInCharsToPixels
getTopIndex
addKeyListener
getForeground()
createNewFile
connect
SN:org.eclipse.jface.text.IRegion
expandAll
selectionChanged
SN:org.eclipse.core.resources.IMarker
SN:java.lang.StringBuffer
SN:java.net.URI.getScheme()
setSelectedRange
getDescriptor
SN:org.eclipse.jface.viewers.IStructuredSelection
renameTo
SN:org.eclipse.jface.viewers.TableLayout
getVisibleRegion
SN:org.eclipse.ui.Saveable
getToolTipText
getWidgetProperty
SN:java.util.HashSet
getWarnings
SN:org.eclipse.swt.widgets.Text.getText()
getMenu
available
toControl
System.getProperty()
SN:java.lang.String.indexOf()
addDisposeListener
subtract
observe
SN:org.eclipse.jface.text.Position.getOffset()
getExpandedState
grab
SN:java.util.List.toArray()
_getChildren
createWidget
SN:org.eclipse.osgi.internal.module.ResolverBundle
getMonitor
Boolean.valueOf().toString()
Messages.format()
getValue()
getSelectionProvider
Math.min()
LayoutExample.getResourceString()
getThumbNail
SN:org.eclipse.jface.action.IMenuListener
getName()
SN:org.eclipse.swt.graphics.Pattern
mkdir
SN:org.eclipse.swt.dnd.DropTargetEvent
byteValue
SN:org.eclipse.jface.text.link.LinkedPosition
SN:org.eclipse.jdt.internal.ui.preferences.OptionsConfigurationBlock.Key
setTime
updateButtons
getTemplate
setErrorMessage
SN:org.eclipse.jface.bindings.Binding
compareToIgnoreCase
restoreGraphicsState
addPage
setAccessible
getDescription
getPositions
removeFilter
SN:org.eclipse.jdt.core.dom.Expression
getCursorLocation
SN:org.eclipse.jface.viewers.Viewer
SN:org.eclipse.swt.widgets.ToolBar
SN:java.lang.String.toLowerCase()
SN:org.eclipse.ui.IWorkbenchPart
getShells
fill
addPosition
SN:org.eclipse.swt.widgets.Widget
SN:org.eclipse.equinox.internal.ds.model.ServiceComponentProp
openTD()
disposeTextLayout
SN:org.eclipse.swt.graphics.TextLayout
SN:org.eclipse.swt.widgets.Composite.getDisplay().getSystemColor()
addMenuListener
getContainer
getNameText
SN:org.eclipse.swt.widgets.Label
overlapsWith
saveGraphicsState
setThumb
SN:java.util.Map.Entry.getValue()
SN:org.eclipse.jface.preference.IPreferenceStore.getBoolean()
getX
showSelection
getGrayed
SN:java.lang.String.getBytes()
SN:org.eclipse.jface.text.source.ISourceViewer
SN:org.eclipse.jface.preference.IPreferenceStore.getDefaultBoolean()
SN:org.eclipse.swt.events.MouseListener
removeDocumentListener
SN:org.eclipse.jface.text.IDocumentListener
performCancel
SN:org.eclipse.ui.internal.registry.IActionSetDescriptor
setRadioSelection
addFocusListener
SN:org.eclipse.debug.internal.ui.viewers.model.provisional.IPresentationContext.getId()
setIncrement
setMinimum
addAccessibleListener
writeBoolean
getMainAttributes
killFocus
SN:org.eclipse.jface.wizard.IWizardPage
putValue
SN:org.eclipse.jdt.launching.IVMInstall
isSeparator
SN:org.eclipse.swt.graphics.Device.getSystemColor()
SN:org.eclipse.pde.api.tools.internal.provisional.model.IApiComponent
setDefaultButton
sendEvent
setExpanded
setDaemon
SN:org.eclipse.debug.core.ILaunch
readShort
isArray
nativeToJava
SN:org.eclipse.jface.bindings.TriggerSequence
SN:org.eclipse.jdt.internal.ui.preferences.formatter.LineWrappingTabPage.Category
concat
getSchemeSpecificPart
SN:org.eclipse.swt.accessibility.AccessibleAdapter
SN:org.eclipse.jface.action.IMenuManager
SN:org.eclipse.core.resources.mapping.ResourceMapping
SN:org.eclipse.swt.widgets.Composite.getBackground()
SN:org.eclipse.debug.core.model.IMemoryBlock
RemoteAntMessages.getString()
SN:org.eclipse.ui.IWorkbenchWindow
menuShell
findWidget
SN:org.eclipse.core.resources.IResource.getProject()
Messages.getString()
SN:org.eclipse.ui.internal.registry.EditorDescriptor
SN:org.eclipse.jdt.internal.corext.refactoring.typeconstraints.types.TType
SN:org.eclipse.swt.examples.graphics.GraphicsBackground.getThumbNail()
setLineWidth
checkAdvancedGraphics
timerExec
ASTNodeFactory.newModifiers()
Signature.toString()
SN:org.eclipse.core.runtime.IPath.toOSString()
getBuffer
invoke
getBgColor1
getCanonicalFile
SN:org.eclipse.jface.viewers.ViewerComparator
cancelPressed
removePosition
getTextLayout
SN:java.util.HashMap
uninstall
setFileName
previous
SN:org.eclipse.swt.widgets.Item
reveal
getString()
isEnabled()
setDescription
SN:org.eclipse.debug.core.ILaunchConfiguration.getAttribute()
getTransparencyType
SN:org.eclipse.jdt.launching.IRuntimeClasspathEntry
beginCompoundChange
removeDisposeListener
putNextEntry
SN:org.eclipse.jdi.internal.request.EventRequestImpl.requestID()
getCell
SN:org.eclipse.ui.views.markers.internal.MarkerType
addDocumentListener
SN:org.eclipse.jdt.core.IPackageFragmentRoot
SN:org.eclipse.core.runtime.IPath.toString()
isAssignableFrom
getPreferenceName()
isPageComplete
SN:java.lang.Object.toString()
unhook
hasFocus
getMaximum
convert()
SN:org.eclipse.ui.forms.widgets.FormToolkit.getColors().getColor()
SN:java.util.jar.JarEntry
SN:org.eclipse.ui.ISharedImages.getImageDescriptor()
getAverageCharWidth
SN:org.eclipse.jface.text.IDocument.get()
SN:org.eclipse.swt.widgets.TableItem.getText()
floatValue
setHoverImageDescriptor
removeSelectionListener
hide
SN:org.eclipse.jface.wizard.WizardPage
SN:java.lang.String.equals()
getHeaderVisible
getContextClassLoader
getFilterPath
setTransform
SN:org.eclipse.swt.graphics.Transform
setAlpha
SN:org.eclipse.debug.core.model.IDebugTarget
SN:org.eclipse.team.internal.ccvs.core.ICVSRepositoryLocation
getActionDefinitionId
endCompoundChange
SN:org.eclipse.jdt.core.IField
createContents
deselectAll
setOffset
createExampleGroup
getToggleState
Utils.getPropertyFormat()
computeTabList
isDefault
getPaths
window
getImage()
removeMouseListener
SN:org.eclipse.swt.events.FocusListener
SN:org.eclipse.jface.dialogs.IDialogSettings.getBoolean()
SN:org.eclipse.core.runtime.IConfigurationElement.getAttribute()
getPort
SN:org.eclipse.equinox.frameworkadmin.BundleInfo
writeLong
SN:java.util.ArrayList.get()
configure
SN:org.eclipse.jface.text.contentassist.ICompletionProposal
getDefaultString
removeFocusListener
Long.toString()
enableWidget
getLegalLineDelimiters
SN:org.eclipse.jface.viewers.ViewerCell
intern
SN:org.eclipse.ui.console.IConsole
hook
setAlignment
SN:org.eclipse.swt.graphics.Point.SN:INT
isValid
removeFirst
getPattern
SN:org.eclipse.jface.text.IPositionUpdater
getSegment
getAction
canWrite
getKey()
SN:org.eclipse.swt.internal.mozilla.nsEmbedString.getAddress()
getSelectionRange
getHorizontalBar
initWithString
SN:org.eclipse.jdt.internal.ui.wizards.dialogfields.TreeListDialogField.E
getCategory()
SN:java.io.File.getAbsolutePath()
forceFocus
SN:org.eclipse.osgi.service.resolver.BundleDescription.getSymbolicName()
SN:org.eclipse.swt.ole.win32.OleListener
createStyleGroup
setExampleWidgetState
getTransparencyMask
group
SN:org.eclipse.swt.graphics.FontData
addObject
getSelectionIndices
isPrimitive
fillPolygon
SN:org.eclipse.core.runtime.IStatus.getMessage()
setPreferenceStore
removeControl
getExpandedElements
SN:java.util.Date
getContextId
SN:java.lang.Long
getLine
getContextType
SN:org.eclipse.swt.internal.mozilla.XPCOMObject.getAddress()
bounds
SN:org.eclipse.swt.widgets.Combo.getText()
getRGBs
SN:org.eclipse.swt.internal.cocoa.NSSize
IDEWorkbenchPlugin.getIDEImageDescriptor()
setBackgroundPattern
SN:org.eclipse.jface.text.source.IAnnotationModel
drawString
SN:org.eclipse.osgi.framework.internal.core.BundleContextImpl
getClass().getName()
setTarget
_getTabList
Compatibility.getMessage()
SN:org.eclipse.jdt.core.dom.IMethodBinding
SN:org.eclipse.jface.text.DocumentEvent
SN:java.io.PrintStream
SN:org.eclipse.pde.core.plugin.IPluginModelBase.getPluginBase().getId()
SN:org.eclipse.team.core.synchronize.SyncInfo
hasPrevious
addPositionCategory
isFocusCaret
SN:org.eclipse.ui.internal.keys.model.BindingElement
SN:org.eclipse.core.runtime.CoreException.getStatus()
PDEPlugin.getDefault().getLabelProvider()
SN:org.eclipse.swt.widgets.Spinner.getSelection()
testFindItem
getStart
type
getStyleRanges
newLine
showPage
getButton
setName
SN:org.eclipse.pde.internal.core.ischema.ISchemaObject
getAnnotationModel
getBorderWidth
getOldValue
SN:java.util.List.size()
setExpandedElements
getByteOrder
FormLayoutFactory.createFormGridLayout()
removePositionCategory
SN:org.eclipse.jdt.core.dom.SimpleName
createGridData()
SN:org.eclipse.jdt.core.dom.IVariableBinding
Thread.currentThread()
skip
setTextLimit
getAction()
getTypeName()
SN:java.io.PrintWriter
closeEntry
getFilters
mainFrame
deleteOnExit
destroy
getSelectionText
SN:org.eclipse.jface.viewers.ITreeContentProvider
retainAll
SN:org.eclipse.ui.contexts.IContextActivation
getList
SN:org.eclipse.jdt.internal.corext.refactoring.ParameterInfo
SN:org.eclipse.swt.widgets.Combo.indexOf()
getRole
notifyListeners
javaToNative
getDefaultBoolean
SN:org.eclipse.swt.browser.WindowEvent
SN:org.eclipse.swt.internal.cocoa.NSColor
getLocationAtOffset
SN:org.eclipse.jface.text.templates.persistence.TemplatePersistenceData
SN:org.eclipse.swt.events.SelectionEvent
SN:org.eclipse.core.runtime.IAdaptable
collapseAll
getSuperclass
charValue
SN:java.io.FileInputStream
SN:org.eclipse.core.resources.IResource.getName()
SN:org.eclipse.swt.browser.ProgressEvent
SN:org.eclipse.jdt.core.dom.SingleVariableDeclaration
getTriggerSequence
MessageUtil.getString()
isTabGroup
SN:org.eclipse.swt.widgets.TreeColumn
getFD
addEventListener
getErrorMessage
SN:java.net.URL.toExternalForm()
addCheckStateListener
createChildPath
addFirst
setEditor
getLineOfLastMouseButtonActivity
SN:org.eclipse.jface.text.templates.Template
SN:java.util.Hashtable
flushCache
SN:org.eclipse.swt.browser.StatusTextEvent
createImageWithDefault
SN:org.eclipse.team.core.diff.IDiff
SN:org.eclipse.jdt.core.IMethod.getElementName()
setVisibleItemCount
modifierFlags
SN:org.eclipse.search.ui.text.Match
getInitialSize
SN:org.eclipse.jdt.internal.debug.core.model.JDIDebugTarget
SN:org.eclipse.ui.internal.navigator.extensions.NavigatorContentDescriptor
getDeclaredFields
removeKeyListener
SN:org.eclipse.ui.IEditorDescriptor
getChangeType
keyCode
exec
SN:org.eclipse.swt.graphics.GCData
getColumnIndex
SN:org.eclipse.team.ui.synchronize.ISynchronizeModelElement
copy
getCaret
setParent
SN:org.eclipse.swt.events.KeyListener
SN:org.eclipse.jdt.core.dom.Statement
SN:java.util.Properties.getProperty()
getSystemFont
SN:org.eclipse.swt.widgets.Combo.getSelectionIndex()
inputChanged
cellSize
SN:org.eclipse.team.internal.ccvs.core.CVSTag
resolve
traverse
SN:org.eclipse.swt.widgets.Text.getDisplay().getSystemColor()
filters
SN:CHAR.SN:INT
getViewer
this.getClass()
getEndLine
SN:org.eclipse.equinox.p2.engine.IProfile
setNeedsDisplayInRect
getLineBounds
SN:org.eclipse.jdt.core.dom.AST.newModifier()
getColumnOrder
SN:org.eclipse.jdt.internal.core.JavaProject
SN:org.eclipse.equinox.p2.metadata.IInstallableUnit.getId()
drawPath
SN:org.eclipse.swt.events.TraverseListener
SN:org.eclipse.jface.bindings.keys.KeyBinding
SN:org.eclipse.jface.viewers.IStructuredContentProvider
SN:org.eclipse.equinox.p2.metadata.IArtifactKey
includes
getContent
SN:org.eclipse.jdt.internal.ui.preferences.formatter.WhiteSpaceOptions.InnerNode
SN:org.eclipse.jface.viewers.SelectionChangedEvent
getPreferenceKey()
getEventListener
SN:org.eclipse.ui.forms.widgets.TableWrapLayout
SN:org.eclipse.jface.viewers.StructuredSelection
setActionDefinitionId
getInternalAccessor
save
returnClassName()
SN:org.eclipse.jdt.internal.ui.text.correction.proposals.FixCorrectionProposal
SN:org.eclipse.swt.widgets.MenuItem
contentView
getInterfaces
SN:org.eclipse.jdt.internal.ui.text.correction.proposals.LinkedCorrectionProposal
Util.translateString()
SN:org.eclipse.swt.widgets.Event.SN:INT
PlatformUI.getWorkbench().getSharedImages().getImageDescriptor()
SN:org.eclipse.swt.internal.cocoa.NSTextContainer
notify
getOrigin
SN:org.eclipse.core.runtime.jobs.Job
selectedRange
getAvailableTypes
getBgImage
getText()
SharedImages.getImageDescriptor()
SN:org.eclipse.ui.IWorkingSet.getName()
setBlockOnOpen
SN:org.eclipse.jface.preference.IPreferenceNode
setUrl
SN:org.eclipse.ui.internal.LayoutPart
getDialogSettingsSectionName()
getProgressMonitor
clearAll
SN:org.eclipse.ui.IEditorInput
getTimeInMillis
SN:org.eclipse.equinox.p2.metadata.expression.IExpression
SN:org.eclipse.jdt.core.IJavaProject.getOption()
setTopIndex
locationInWindow
getColor()
loadDefault
setBackgroundPixel
SN:java.lang.Throwable
SN:org.eclipse.jdt.core.dom.VariableDeclarationFragment
SN:org.eclipse.equinox.p2.metadata.Version
drawPolyline
validate
getTopPixel
SN:org.eclipse.jdt.core.dom.ReturnStatement
SN:java.lang.String.charAt()
SN:org.eclipse.swt.custom.StackLayout
EclipseDebugTrace.TRACE_ELEMENT_DELIMITER
writeShort
getId()
SN:org.eclipse.core.commands.ParameterizedCommand
getAutomation
subList
getClientArea()
SN:org.eclipse.pde.core.plugin.IPluginImport
getComparator
replaceFirst
isTabItem
removeVerifyKeyListener
setDocumentPartitioning
getConfiguredDocumentPartitioning()
SN:org.eclipse.core.commands.operations.IUndoableOperation
SN:java.lang.Integer.intValue()
parentingHandle
SN:org.eclipse.swt.browser.LocationEvent
SN:org.eclipse.swt.widgets.Combo.getItem()
getRed
SN:org.eclipse.swt.widgets.Combo
getPixel
SN:org.eclipse.jdt.apt.core.internal.util.ManyToMany.T1
SN:org.eclipse.jdt.core.dom.TextElement
SN:org.eclipse.ui.internal.views.markers.MarkerFieldFilterGroup
getClipping
JFaceResources.getFont()
SN:org.eclipse.jdt.internal.corext.refactoring.typeconstraints.ConstraintVariable
tabString()
getMethod
setMaximizedControl
SN:org.eclipse.swt.custom.CTabFolder
SN:org.eclipse.jdt.core.IType.getFullyQualifiedName()
setForegroundPixel
SN:org.eclipse.ui.ISourceProvider
JFaceResources.getString()
SN:java.util.Properties
addPostSelectionChangedListener
SN:org.eclipse.jdt.core.dom.IBinding
SN:org.eclipse.ui.IPerspectiveDescriptor
SN:java.io.OutputStream
SN:org.eclipse.pde.core.plugin.IPluginLibrary
OlePlugin.getResourceString()
getColor
SN:java.util.Enumeration.nextElement()
getLineIndex
revealRange
getParameterTypes
hooks
waitFor
getLineInfo
SN:org.eclipse.jface.action.IContributionItem.getId()
draw
isCollapsed
isSelected
SN:org.eclipse.jdt.internal.compiler.apt.util.ManyToMany.T1
showItem
getInput()
shortValue
getAbsoluteFile
SN:org.eclipse.jdt.core.dom.Type
SN:org.eclipse.ui.handlers.IHandlerActivation
name
SN:org.eclipse.jdi.internal.request.EventRequestImpl
getGCData
getNextPage()
join
setSortColumn
SN:org.eclipse.swt.widgets.TableColumn
SN:org.eclipse.swt.accessibility.AccessibleActionEvent
SN:org.eclipse.jface.viewers.ColumnViewer
textStorage
setNeedsDisplay
SN:org.eclipse.swt.internal.cocoa.NSFont
SN:org.eclipse.pde.internal.core.target.provisional.NameVersionDescriptor
generateLayout
SN:org.eclipse.compare.examples.xml.IdMap.getName()
SN:org.eclipse.jdi.internal.event.EventImpl.requestID()
SN:org.eclipse.swt.program.Program.SN:java.lang.String
setBackgroundColor
createButtonsForButtonBar
getResource
tableColumns
setContents
computeIndexInCategory
getLabelText
sync
getHelpListener()
SN:org.eclipse.jdt.core.dom.Name
getPreviousPage
getWeights
frameOfCellAtColumn
getComponentType
SN:java.lang.StringBuffer.length()
removePositionUpdater
setId
runAsyncMessages
arrayTypeFor()
SN:org.eclipse.jface.text.Position.getLength()
invalidateTextPresentation
SN:org.eclipse.jface.text.IDocumentPartitioner
SN:org.eclipse.team.internal.ccvs.ui.CVSUIPlugin.getImageDescriptor()
isExpandable
SN:org.eclipse.swt.accessibility.AccessibleEvent
SN:org.eclipse.swt.custom.VerifyKeyListener
setTransfer
SWTUtils.createGridData()
SN:org.eclipse.swt.widgets.Text.getText().trim()
getGreen
doOperation
SN:java.util.Map.size()
SN:org.eclipse.swt.widgets.TreeItem.getData()
SN:org.eclipse.equinox.p2.repository.artifact.IArtifactDescriptor
SN:org.eclipse.swt.events.ControlListener
getBlue
currentEvent
setTabItemFocus
insertAfter
setDocumentPartitioner
SN:java.util.Vector
SN:org.eclipse.jface.action.ActionContributionItem
setFrame
SN:org.eclipse.equinox.p2.metadata.IInstallableUnit.getVersion()
getLanguage
SN:DOUBLE
SN:org.eclipse.jdt.core.dom.TagElement
initialize
span
SN:org.eclipse.jface.text.templates.TemplateVariable
SN:org.eclipse.core.runtime.IProgressMonitor
isAlive
SN:org.eclipse.swt.accessibility.Accessible
isGroupMarker
pattern
getDotName()
SN:java.io.File.getName()
hasValueFor
cancel
SN:org.eclipse.jface.text.DocumentEvent.getOffset()
SN:org.eclipse.jdt.core.dom.AST.newExpressionStatement()
toString()
SN:org.eclipse.osgi.internal.module.ResolverBundle.SN:java.lang.Long
getPreferenceStore().getDefaultBoolean()
SN:org.eclipse.jdt.apt.core.internal.util.ManyToMany.T2
SN:org.eclipse.core.resources.IProject.getName()
SN:org.eclipse.jdt.core.IType.getElementName()
SN:org.eclipse.ui.IEditorPart
SN:org.eclipse.jface.text.link.LinkedPositionGroup
SN:org.eclipse.jface.text.source.projection.ProjectionAnnotation
headerCell
SN:org.eclipse.jdt.core.dom.SimpleName.getIdentifier()
SN:org.eclipse.jdt.internal.core.Openable
SN:org.eclipse.jface.viewers.CheckStateChangedEvent.getElement()
getBandHeight
getLength()
setRGB
getLeading
SN:org.eclipse.swt.accessibility.AccessibleTableCellEvent
SN:org.eclipse.jdt.internal.corext.refactoring.structure.CompilationUnitRewrite.getCu()
SN:org.eclipse.equinox.region.Region
SN:org.eclipse.pde.api.tools.internal.provisional.model.IApiTypeContainer
createGridLayout()
removeAllPoints
getLinePixel
SN:org.eclipse.ui.IWorkingSet.getId()
SN:org.eclipse.osgi.framework.internal.core.AbstractBundle
markDirty
SN:org.eclipse.swt.graphics.ImageData.SN:INT
deactivate
SN:org.eclipse.swt.layout.FillLayout
fillPath
getNextEntry
SN:org.eclipse.jface.text.IEditingSupport
Signature.toString().replace()
autorelease
setStyleRanges
SN:org.eclipse.compare.internal.core.patch.FilePatch2
isRowSelected
disconnect
SN:org.eclipse.jdt.internal.compiler.batch.FileSystem.Classpath
getOrientation
getDeclaredField
containsValue
isLabelProperty
getOutputStream
forceActive
hasChildren
getItemY
canFinish
SN:org.eclipse.jface.text.DocumentRewriteSession
getInitialLocation
SN:org.eclipse.ui.internal.provisional.cheatsheets.ICompositeCheatSheetTask
getFileNames
SN:org.eclipse.core.resources.IFolder
translate
getDepth
Action.findModifierString()
setItemCount
getLineOffsets
currentEditor
SN:org.eclipse.swt.widgets.Event.SN:java.lang.String
isFlipped
SN:org.eclipse.jdt.internal.compiler.lookup.FieldBinding
JFaceResources.getImage()
SN:org.eclipse.swt.examples.graphics.GraphicsBackground.getBgColor1()
getImageDescriptor()
setStyle
selectedRowIndexes
setExpandHorizontal
SN:org.eclipse.equinox.internal.ds.model.ServiceComponent
setDelegate
show
addHelpListener
getOrderIndex
SN:org.eclipse.jface.viewers.IContentProvider
SN:SHORT
SN:org.eclipse.swt.layout.FormLayout
SN:org.eclipse.core.runtime.jobs.ISchedulingRule
SN:org.eclipse.swt.events.KeyAdapter
getBlockSelection
getHorizontalPixel
SN:org.osgi.util.tracker.AbstractTracked.S
SN:org.eclipse.core.runtime.QualifiedName
Platform.getOS()
SN:org.eclipse.swt.widgets.Composite.computeSize()
SN:org.eclipse.ui.forms.widgets.Section
removeAnnotationModelListener
SN:org.eclipse.core.resources.IResource.getFullPath()
SN:org.eclipse.jface.text.ITypedRegion.getType()
decorateText
SN:org.eclipse.jdt.internal.compiler.lookup.ReferenceBinding
removePostSelectionChangedListener
SN:org.eclipse.core.filesystem.IFileStore
SN:java.security.Permission
setExpandedState
addButtonWithTitle
SN:org.eclipse.swt.widgets.Table
strlen
SN:org.eclipse.swt.internal.cocoa.NSAttributedString
StringConverter.asString()
SN:org.eclipse.pde.internal.ui.launcher.FeatureBlock.ButtonSelectionListener
getFragment
toClientRectangle
headerView
SN:org.eclipse.debug.core.sourcelookup.ISourceContainer
destroyWidget
SN:org.eclipse.ui.internal.browser.IBrowserDescriptor
SN:org.eclipse.jdt.internal.compiler.apt.util.ManyToMany.T2
SN:org.eclipse.swt.internal.cocoa.NSTableColumn
addDoubleClickListener
SN:org.eclipse.pde.api.tools.internal.provisional.model.IApiBaseline.getName()
SN:org.eclipse.jdt.internal.ui.wizards.dialogfields.ListDialogField.E
SN:org.eclipse.ui.views.markers.MarkerField
getDialogSettings
getImageBounds
SN:java.lang.String.trim()
addMouseTrackListener
SN:org.eclipse.osgi.internal.resolver.BundleDescriptionImpl
setLastModified
addLayoutDeferred
setOrientation
handleDispose
getCtrl
getEditable
SN:org.eclipse.core.runtime.content.IContentType
SN:org.eclipse.swt.browser.TitleEvent
string
setModel
SN:org.eclipse.swt.widgets.Group
addPaintListener
SN:org.eclipse.jdt.internal.corext.refactoring.typeconstraints2.ITypeConstraint2
SN:org.eclipse.ui.texteditor.RetargetTextEditorAction
SN:org.eclipse.debug.internal.ui.viewers.model.provisional.IColumnPresentation.getId()
setExpandVertical
minus
addTextInputListener
getStartingPage
transferClipping
drawPolygon
setActiveScheme
getLayer
setMinimized
MetadataFactory.createRequirement()
SN:java.util.Map.values()
SN:org.eclipse.ui.IEditorDescriptor.getId()
SN:java.util.Locale
setSubtreeChecked
SN:org.eclipse.core.resources.IResource.getParent()
paint
SN:org.eclipse.jdt.internal.ui.preferences.OptionsConfigurationBlock.Key.getName()
setAttributedTitle
createString()
UrlUtil.htmlEncode()
removeModifyListener
paste
SN:org.eclipse.swt.events.MouseAdapter
SN:java.util.Vector.elementAt()
getHoverInfo
getDescent
SN:org.eclipse.pde.internal.core.target.provisional.IResolvedBundle
addPath
SN:org.eclipse.equinox.frameworkadmin.BundleInfo.getSymbolicName()
setSortDirection
addTextListener
setForegroundPattern
Boolean.valueOf()
setRegion
execute
SN:org.eclipse.debug.core.model.IExpression
firePropertyChangeEvent
getMinimized
SN:org.eclipse.jface.viewers.TreeViewer.getSelection()
setFilterExtensions
toASCIIString
decorateImage
SN:org.eclipse.pde.internal.core.target.provisional.ITargetDefinition
setCaret
SN:org.eclipse.debug.ui.memory.IMemoryRendering
SN:org.eclipse.pde.api.tools.internal.provisional.model.IApiType.getName()
getRewriteTarget
requestWidgetToken
setMinimumPageSize
realizeWidget
SN:org.eclipse.swt.accessibility.AccessibleEditableTextEvent
SN:java.util.Set.toArray()
yearOfCommonEra
SN:java.net.URL.getProtocol()
SN:java.util.Map.keySet()
SN:org.eclipse.jdt.internal.compiler.ast.ASTNode
SN:java.io.StringWriter.toString()
SN:java.lang.Class.getName()
getPlatform
rowAtPoint
SN:org.eclipse.swt.accessibility.AccessibleTextListener
SN:org.eclipse.team.internal.ccvs.core.ICVSResource
hideInformationControl
ImageResource.getImage()
HelpUIResources.getImageDescriptor()
Utilities.getString()
sort
SN:org.eclipse.pde.internal.core.text.IDocumentKey
checkWidget
getTypeIds
runSkin
getWindowTitle
stopRewriteSession
performFinish
SN:org.eclipse.pde.internal.build.Config
setCharAt
setColumnProperties
SN:org.eclipse.swt.layout.RowLayout
SN:org.eclipse.swt.internal.win32.TCHAR.strlen()
setEchoChar
SN:org.eclipse.jdt.core.dom.TagElement.getTagName()
SN:org.eclipse.jface.viewers.TreeViewer.getControl()
addMouseMoveListener
getButtonGridData()
setCursorLocation
SN:org.eclipse.team.internal.ccvs.core.CVSTag.getName()
SN:org.eclipse.jdt.core.IJavaElement.getElementName()
SN:org.eclipse.swt.internal.cocoa.NSMenuItem
dayOfMonth
getDisplayString
SN:org.eclipse.jdt.core.dom.IfStatement
SN:org.eclipse.ui.IMemento.getString().equals()
drawRectangle
removeTextInputListener
setMoveable
getIncrement
getWizard
ready
SN:org.eclipse.jdt.core.dom.SingleVariableDeclaration.getName().getIdentifier()
bringToTop
addPositionUpdater
divide
SN:org.eclipse.ltk.core.refactoring.Change
addTraverseListener
SN:org.eclipse.swt.graphics.Color.getRGB()
getEnd
numColumns
getModifierKeys
isDirty
propertyNames
setMinSize
SWTUtils.createGridLayout()
image
removeTextListener
getPreferenceStore
colorImage()
userSpaceScaleFactor
SN:org.eclipse.swt.internal.cocoa.NSView
removeControlListener
SN:org.eclipse.jdt.core.dom.ITypeBinding.getQualifiedName()
setAttributedStringValue
removeShellListener
SN:org.eclipse.jdt.internal.corext.refactoring.typeconstraints2.ConstraintVariable2
getSchemeId
getEditingSupport
SN:java.io.FileOutputStream
SN:org.eclipse.jface.viewers.TableViewer.getSelection()
createButtonBar
removeElementAt
SN:java.util.HashMap.get()
SN:org.eclipse.search.ui.ISearchQuery
canDoOperation
isComplete
selectedRow
getMenuBar
createShell
getPixbuf
SN:org.eclipse.swt.internal.cocoa.id
SN:org.eclipse.jface.text.source.SourceViewerConfiguration
getThumb
createHFillGridData()
Util.getDeltaFlagsName()
SN:org.eclipse.jdt.internal.ui.text.template.contentassist.MultiVariable
containsPositionCategory
SN:org.eclipse.team.ui.synchronize.ISynchronizeParticipant
SN:org.eclipse.ui.internal.progress.JobInfo
SN:org.eclipse.pde.api.tools.internal.provisional.problems.IApiProblem
SN:java.lang.String.replace()
SN:org.eclipse.jface.text.templates.TemplateContext
SN:org.eclipse.swt.events.MouseMoveListener
setFill
getAlt
getLinesVisible
newModifier()
getPrimaryMonitor
getTitle
readFully
SN:org.eclipse.core.internal.content.ContentType
SN:org.eclipse.swt.dnd.DragSourceEvent
IdentityWrapper.wrap()
SN:org.eclipse.jface.viewers.LabelProviderChangedEvent
removeRelation
SN:org.eclipse.jdt.core.dom.VariableDeclarationStatement
insertBefore
addData
SN:org.eclipse.ui.views.tasklist.MarkerType
SN:org.eclipse.swt.internal.cocoa.NSWindow
TextTransfer.getInstance()
SN:org.eclipse.ui.internal.dialogs.CustomizePerspectiveDialog.DisplayItem
addDragSupport
setAntialias
getRanges
SN:org.eclipse.jdt.debug.core.IJavaDebugTarget
TextProcessor.process()
setMenuBar
SN:org.eclipse.jdt.core.dom.ITypeBinding.getName()
setPageComplete
getOffsets
cut
SN:org.eclipse.jdt.internal.compiler.ast.TypeReference
getTemplateData
moveToPoint
setFontList
SN:java.io.File.getPath()
setBaseWritingDirection
SN:org.eclipse.equinox.p2.repository.metadata.IMetadataRepository
getUrl
JFaceTextMessages.getString()
SN:org.eclipse.ui.internal.progress.JobTreeElement
SN:org.eclipse.swt.widgets.Control.getFont()
removeMenuListener
SN:java.util.ArrayList.toArray()
JFaceResources.getBannerFont()
SN:org.eclipse.core.runtime.CoreException
getChannel
getQuery
SN:org.eclipse.pde.api.tools.internal.provisional.comparator.IDelta
superview
getLong
SN:org.eclipse.compare.structuremergeviewer.ICompareInput
SN:org.eclipse.swt.internal.cocoa.SWTWebViewDelegate
getTextBounds
RemoveEventListener
SN:org.eclipse.compare.examples.xml.Mapping
SN:org.eclipse.ui.IViewReference
SN:org.eclipse.jface.viewers.CellEditor
getControl()
filter
SN:org.apache.tools.ant.Project
SN:org.eclipse.team.internal.core.subscribers.ChangeSet
getHighContrast
SN:org.eclipse.jdt.core.search.SearchMatch
SN:org.eclipse.jdt.core.dom.rewrite.ITrackedNodePosition.getStartPosition()
SN:org.eclipse.jdt.core.dom.rewrite.ITrackedNodePosition.getLength()
getModificationStamp
flip
SN:java.lang.Boolean
SN:org.eclipse.jdt.core.dom.AST.newSimpleName()
Thread.currentThread().getName()
SN:org.eclipse.core.resources.IBuildConfiguration
removeAnnotation
SN:org.eclipse.pde.internal.core.ifeature.IFeatureModel
lineToPoint
SN:java.util.Calendar.get()
getSorter
SN:org.eclipse.swt.program.Program
SN:java.util.StringTokenizer.nextToken().trim()
getPreferenceStore().getBoolean()
addGroup
checkPermission
updateLayout
monthOfYear
SN:org.eclipse.team.core.RepositoryProvider
SN:org.osgi.framework.Version.getMinor()
objectForKey
getToolBarManager
FormLayoutFactory.createFormPaneGridLayout()
SN:org.eclipse.ui.internal.registry.PerspectiveDescriptor
SN:java.lang.Object.getClass()
getParentPath
SN:org.eclipse.ui.texteditor.ITextEditor
SN:org.eclipse.jdt.core.dom.TypeParameter
isDynamic
intersect
SN:org.eclipse.ui.IPerspectiveDescriptor.getId()
SN:org.eclipse.debug.core.model.IThread
Character.toUpperCase()
SN:org.osgi.framework.Version.getMajor()
SN:org.eclipse.jface.viewers.ViewerColumn
getErrorStream
getColumnText
SN:org.eclipse.jface.viewers.ICheckStateListener
SN:org.eclipse.pde.api.tools.internal.provisional.descriptors.IElementDescriptor
SN:org.eclipse.pde.internal.ua.core.icheatsheet.comp.ICompCSTaskObject
setShowOnlyOnFocus
SN:org.eclipse.jface.fieldassist.FieldDecoration.getImage()
setTextAntialias
SN:org.eclipse.pde.core.plugin.IPluginExtension
isMarkedDeleted
getShift
setLayoutDeferred
SN:org.eclipse.update.core.IPluginEntry
SN:java.io.ByteArrayOutputStream.toByteArray()
SN:org.eclipse.equinox.internal.p2.director.Projector.AbstractVariable
removePaintListener
setHelpAvailable
SN:org.eclipse.ui.internal.console.IOConsolePartition
getReturnType
SN:org.eclipse.ui.navigator.INavigatorContentDescriptor
SN:org.eclipse.swt.graphics.TextStyle.SN:org.eclipse.swt.graphics.Color
initWithCapacity
removeAllElements
setPage
unconfigure
margins
ArrayContentProvider.getInstance()
setCellEditors
SN:org.eclipse.jface.bindings.Scheme
SN:org.eclipse.pde.api.tools.internal.ApiJavadocTag
SN:org.eclipse.jdt.launching.environments.IExecutionEnvironment
title
setActiveControl
getIME
getPackage()
SN:org.eclipse.search.ui.text.AbstractTextSearchResult
getSourceViewer
restore
getDocumentPartitioner
SN:org.eclipse.swt.custom.TextChangeListener
getOffset()
getRemovedLinesBelow
intersects
isHighlighted
numberOfSelectedRows
canFlipToNextPage
SN:org.eclipse.swt.internal.cocoa.NSEvent
SN:org.eclipse.ui.menus.AbstractContributionFactory
empty
SN:org.eclipse.swt.internal.image.PngIhdrChunk
SN:org.eclipse.ui.internal.intro.universal.BaseData
setWeights
setPatternItems
getFocusCell
Boolean.toString()
SN:java.lang.Boolean.booleanValue()
initWithIndex
evaluate
getImageDescriptor
SN:org.eclipse.jdt.core.dom.IMethodBinding.getName()
Util.toString()
SN:java.util.Dictionary.get()
SN:org.eclipse.jdt.core.IType.getCompilationUnit()
SN:java.lang.Exception
AddEventListener
getContentType
URL
getAscent
SN:org.eclipse.jdt.debug.core.IJavaObject
SN:org.osgi.framework.Bundle.getLocation()
SN:org.eclipse.jdt.core.compiler.CategorizedProblem
initWithIdentifier
SN:org.eclipse.pde.internal.runtime.spy.SpyFormToolkit.createClassSection()
SN:org.eclipse.swt.graphics.Device
MultiMatcherLocalization.getLocalMultiMatcherKey()
SN:org.eclipse.jface.bindings.keys.KeySequence
SN:org.eclipse.core.runtime.IPath.lastSegment()
getCountry
SN:org.eclipse.jface.viewers.ViewerCell.getColumnIndex()
getParentMenu
getFieldEditorParent()
SN:org.eclipse.swt.internal.photon.PhKeyEvent_t
SN:org.eclipse.jdt.core.IPackageFragment.getElementName()
SN:org.eclipse.jdt.core.search.TypeNameMatch
SN:org.eclipse.jface.contentassist.IContentAssistSubjectControl
SN:org.eclipse.swt.examples.paint.FigureDrawContext.toClientRectangle()
getActualMaximum
dragEnter
addControlListener
SN:org.eclipse.pde.api.tools.internal.provisional.model.IApiComponent.getSymbolicName()
decode
SN:org.eclipse.jdt.internal.compiler.apt.dispatch.BaseProcessingEnvImpl.getFactory().newTypeMirror()
SN:org.eclipse.osgi.internal.serviceregistry.ServiceRegistrationImpl
SN:org.eclipse.ui.actions.WorkspaceModifyOperation
SN:org.eclipse.core.commands.operations.IUndoContext
SN:org.eclipse.help.internal.criteria.CriterionResource
SN:java.lang.Comparable
SN:org.eclipse.jdt.internal.junit.model.TestElement
clearRubberbandSelection
SN:org.eclipse.update.core.IFeatureReference
SN:org.eclipse.jface.text.templates.Template.getContextTypeId()
setSizeConstraints
SN:java.util.regex.Matcher.start()
SN:org.eclipse.swt.internal.cocoa.SWTTreeItem
drawText
SN:org.eclipse.jface.preference.IPreferenceStore.getString()
accept
SN:org.osgi.framework.Bundle.getSymbolicName()
SN:org.eclipse.pde.internal.ui.elements.NamedElement
replaceCharactersInRange
previousIndex
SN:org.eclipse.help.ui.internal.views.ScopeSet
SN:org.eclipse.pde.core.plugin.IPluginObject
SN:org.eclipse.pde.internal.core.ifeature.IFeature.getId()
addPainter
computeTabGroup
SN:org.eclipse.jdt.internal.debug.ui.actions.RuntimeClasspathAction
SN:org.eclipse.pde.internal.core.FeatureTable.Idver
SN:com.ibm.icu.util.Calendar.get()
width
seek
enter
setStyleRange
SN:org.eclipse.jface.viewers.TreeViewer.getInput()
SN:org.eclipse.jdt.internal.core.builder.SourceFile
SN:org.eclipse.jface.action.MenuManager.createContextMenu()
SN:org.eclipse.help.internal.UAElement
getProtectionDomain
addToRoot
hasListeners
getMaximized
setAutoActivationDelay
SN:org.eclipse.equinox.p2.metadata.IRequirement
getKnownElements
PaintExample.getResourceString()
SN:org.eclipse.core.runtime.Preferences.getBoolean()
SN:org.eclipse.swt.events.VerifyEvent
SN:java.util.Iterator.next().toString()
getElement()
getListBackgroundColor()
SN:org.eclipse.jface.viewers.IStructuredSelection.getFirstElement()
getCellPadding
SN:org.eclipse.swt.custom.StyledText.getFont()
SN:org.eclipse.equinox.internal.p2.discovery.model.CatalogItem
SN:org.eclipse.jface.viewers.ICellEditorListener
createOtherGroup
getDoubleClickTime
getCallback
getLastEventTime
SN:org.eclipse.pde.core.IModelChangedEvent.getChangedObjects()
SN:org.eclipse.compare.ITypedElement
SN:org.eclipse.swt.internal.cocoa.NSMenu
getLastModified
SN:org.eclipse.swt.internal.image.LEDataOutputStream
getIndent()
mainMenu
removeMouseMoveListener
SN:org.eclipse.ui.externaltools.internal.launchConfigurations.ExternalToolsMainTab.WidgetListener
getPreferenceStore()
SN:org.eclipse.core.resources.IWorkspaceRoot
SN:org.eclipse.ui.views.tasklist.TaskAction
SN:org.eclipse.pde.internal.core.text.bundle.PDEManifestElement
SN:org.eclipse.jdt.ui.text.folding.DefaultJavaFoldingStructureProvider.JavaProjectionAnnotation
closePath
fillInStackTrace
setValid
getComparer
TemplatesPageImages.getDescriptor()
SN:org.eclipse.swt.examples.graphics.GraphicsExample.checkAdvancedGraphics()
getTypeNames
addRelation
getControl2
SN:org.eclipse.swt.custom.StyledText
SN:org.eclipse.pde.internal.build.site.BuildTimeFeature
computeContextInformation
SN:org.eclipse.ui.internal.navigator.actions.CommonActionProviderDescriptor
SN:org.eclipse.jdt.internal.debug.ui.classpath.IClasspathEntry
SN:org.eclipse.jface.dialogs.IDialogSettings
getUndoManager
getRow
addShellListener
setMarginWidth
SN:org.eclipse.swt.accessibility.AccessibleValueEvent
SN:org.eclipse.swt.widgets.CoolBar
SN:org.eclipse.compare.internal.ViewerDescriptor
SN:org.eclipse.core.runtime.IExtension
getMonitors
convertScreenToBase
SN:org.eclipse.jdt.core.ICompilationUnit.getParent()
SN:org.eclipse.pde.internal.core.ischema.ISchemaElement
getFirstSegment
SN:org.eclipse.jface.layout.PixelConverter.convertWidthInCharsToPixels()
SN:org.eclipse.jface.layout.PixelConverter.convertHeightInCharsToPixels()
SN:org.eclipse.jdt.internal.corext.callhierarchy.MethodWrapper
widgetOffset2ModelOffset
SN:org.eclipse.swt.examples.paint.FigureDrawContext
SN:org.eclipse.pde.api.tools.internal.ApiDescription.ManifestNode
SN:org.eclipse.core.commands.Command
valueForKey
SN:org.eclipse.jdt.internal.ui.browsing.LogicalPackage
SN:java.net.URI.toString()
focusHandle
getContentProvider()
SN:org.eclipse.debug.internal.ui.launchConfigurations.LaunchShortcutExtension
stroke
getQualifiedName()
setPreviousPage
createControlWidgets
format()
rowHeight
SN:org.eclipse.equinox.internal.p2.discovery.model.Tag
SN:org.eclipse.pde.api.tools.internal.util.FilteredElements
addObserver
removePainter
getYear
SN:org.eclipse.team.core.diff.IDiff.getPath()
setAdvanced
setDateValue
SN:org.eclipse.ui.presentations.IPresentablePart
getType()
getFloat
setMinWidth
setPreferredSize
getEditor
SN:org.eclipse.equinox.p2.engine.spi.Touchpoint
setStatusMessage
SN:org.eclipse.update.internal.operations.FeatureHierarchyElement
SN:org.eclipse.jdt.internal.ui.wizards.buildpaths.CPUserLibraryElement
SN:org.eclipse.ui.services.IEvaluationReference
setTextColor
ASTNodeFactory.newName()
getCoolBarManager2
getDefaultInt
releaseWidgetToken
isAccessible
getEscaped()
forceInstall
SN:org.eclipse.jdt.internal.corext.refactoring.ParameterInfo.getNewName()
getBackgroundColor
SN:org.eclipse.jdt.internal.ui.preferences.formatter.ProfileManager.CustomProfile
getLabelProvider()
SN:org.eclipse.core.runtime.IPath.getDevice()
getMethods
SN:org.eclipse.jdt.core.IJavaProject.getElementName()
moveAbove
getLockObject
SN:org.eclipse.jface.text.source.SourceViewer
Integer.parseInt()
replaceInformationControl
addVerifyKeyListener
isValidThread
runWithEvent
SN:org.eclipse.debug.internal.ui.views.breakpoints.BreakpointContainer
SN:org.eclipse.swt.events.PaintListener
getDispatch
setLocked
SN:org.eclipse.equinox.internal.useradmin.Role
getListeners
FormLayoutFactory.createDetailsGridLayout()
SN:org.eclipse.jdi.internal.connect.ConnectorImpl.StringArgumentImpl.name()
SN:org.eclipse.jdi.internal.connect.ConnectorImpl.StringArgumentImpl
getPages
getTokenLength
SN:org.eclipse.swt.custom.CCombo
SN:org.eclipse.ltk.core.refactoring.RefactoringDescriptorProxy
labelProviderChanged
SN:org.eclipse.jdt.apt.core.internal.util.FactoryContainer
SN:org.eclipse.swt.internal.cocoa.NSMutableDictionary
SN:org.eclipse.jface.viewers.TreeViewer.getTree()
URIUtil.toUnencodedString()
SN:java.io.DataInputStream.readInt()
map
getNonGreedyVariable()
updateStatus
absoluteString
SN:java.lang.String.toString()
SN:org.eclipse.ui.forms.widgets.ExpandableComposite
SN:org.eclipse.pde.core.plugin.IPluginModelBase.getPluginBase().getVersion()
MetadataFactory.createProvidedCapability()
markSupported
SN:org.eclipse.swt.widgets.Canvas
SN:org.eclipse.jdt.internal.corext.refactoring.structure.CompilationUnitRewrite
SN:org.eclipse.core.resources.IResourceDelta.getResource()
EscapeUtils.escapeSpecialChars()
SN:org.eclipse.swt.dnd.DragSourceListener
controlSize
SN:org.eclipse.jface.text.Document
SN:org.eclipse.jdt.ui.wizards.NewTypeWizardPage.ImportsManager.addImport()
encodeText()
getCommand
setColorValue
findAndSelect
dataSource
worked
SN:org.eclipse.help.ITocContribution
itemAtIndex
getKeySequence
ModelObject.create()
getCaretPosition
SN:org.eclipse.debug.internal.ui.viewers.model.VirtualItem
lengthPrefixBase64()
SN:org.eclipse.jface.text.source.CompositeRuler
setCrc
Flags.toString()
SN:org.eclipse.pde.internal.core.ischema.ISchemaElement.getName()
SN:org.eclipse.swt.accessibility.AccessibleEditableTextListener
getLocale
SN:org.eclipse.debug.core.model.IProcess
enableAutoInsert
apply
addTreeListener
SN:org.eclipse.jface.text.templates.Template.getPattern()
verify
nextIndex
SN:org.eclipse.help.ui.internal.views.EngineDescriptor
getColorValue
setGrayChecked
changing
setTabGroupFocus
SN:org.eclipse.swt.accessibility.AccessibleAttributeListener
tcharAt
SN:org.eclipse.swt.internal.ole.win32.COMObject.getAddress()
SN:java.lang.Throwable.toString()
SN:org.eclipse.jdt.ui.actions.SelectionDispatchAction
SN:org.eclipse.jface.text.rules.ICharacterScanner
getLabel()
PlatformUI.getWorkbench().getSharedImages().getImage()
getDecorationContext()
markLayout
JFaceColors.getErrorText()
SN:org.eclipse.compare.rangedifferencer.RangeDifference
SN:org.eclipse.ui.IEditorReference
SN:org.eclipse.jdt.internal.junit.model.TestSuiteElement
SN:org.eclipse.swt.accessibility.AccessibleControlListener
getClass()
getLocalPort
SN:org.eclipse.ui.views.properties.PropertySheetCategory
setSorter
SN:org.eclipse.swt.accessibility.AccessibleHyperlinkListener
getSelectionListener()
SN:org.eclipse.ui.internal.ide.registry.MarkerQueryResult
getMasterDocument
SN:org.osgi.framework.BundleContext.registerService()
drawInRect
setLineDash
SN:org.eclipse.debug.ui.memory.MemoryRenderingElement
SN:org.eclipse.pde.core.plugin.IPluginAttribute.getValue()
normalizeCase()
SN:org.eclipse.jface.viewers.TreeViewer
SN:org.eclipse.pde.internal.ua.core.ctxhelp.text.CtxHelpModel.isEditable()
getManifest
SN:org.eclipse.pde.internal.core.ifeature.IFeature.getVersion()
SN:org.osgi.service.wireadmin.Wire
SN:org.eclipse.jface.text.projection.ProjectionDocumentEvent
getMessageCount
SN:org.eclipse.swt.accessibility.AccessibleTableCellListener
getParams
handleEvent
SN:org.eclipse.text.edits.MoveSourceEdit
SN:org.eclipse.swt.events.MouseEvent.getSource()
EclipseDebugTrace.LINE_SEPARATOR
end
getErrorStream()
getResizable
getKeyStrokes
ResourcesPlugin.getWorkspace().getRoot()
SN:org.apache.tools.ant.types.FileSet
setUnambiguous
SN:org.eclipse.ui.IWorkbenchPage
SN:org.osgi.service.component.ComponentInstance
SN:org.eclipse.jface.text.source.ILineRange
removeHelpListener
SN:org.eclipse.swt.accessibility.AccessibleValueListener
SN:org.eclipse.jdt.debug.core.IJavaThread
SN:org.eclipse.swt.events.DisposeEvent
SN:org.eclipse.swt.internal.cocoa.NSCalendarDate
setGrayedElements
SN:org.eclipse.jdt.core.IClasspathEntry.getPath()
scroll
computeTabRoot
setHotImage
SN:org.eclipse.swt.internal.LONG
convertType()
selectRowIndexes
needsSaving
addAnnotationModelListener
toHex()
setDisabledImage
setAutoExpandLevel
SN:org.eclipse.ui.internal.intro.impl.model.AbstractIntroElement
postEvent
initWithTitle
SN:java.lang.Throwable.getMessage()
resetVisibleRegion
setInterpolation
IDEInternalWorkbenchImages.getImageDescriptor()
layoutItems
getNaturalKey
getField
getOperation()
internal_new_GC
addLast
SN:org.eclipse.swt.internal.cocoa.NSAffineTransform
completed
